[
  {
    "department": "BUSI",
    "number": 89,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "irst-Year Seminar: Special Topics. 3 Credits. Special topics course. Content will vary each semester. Repeat rules: May be repeated for credit; may be repeated in the same term for different topics; 6 total credits. 2 total completions. "
  },
  {
    "department": "BUSI",
    "number": 101,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Management Accounting. 4 Credits. Elements of accounting for management planning, budgeting, and control. Emphasis is on management uses of accounting information. Students may not receive credit for both BUSI 101 and BUSI 106, 107, or 108. "
  },
  {
    "department": "BUSI",
    "number": 106,
    "modifier": "",
    "gen eds": "",
    "requirements": "Pre- or corequisite, ECON 101. ",
    "description": "Financial Accounting CS. 3 Credits. Offered online by Continuing Studies. UNC-Chapel Hill business majors/minors may not take BUSI 106. Role of accounting, basic concepts and methodology, mass data processing, valuation and income determination principles, management and internal control problems, and basic financial statement components. Students may not receive credit for BUSI 106 and BUSI 101. "
  },
  {
    "department": "BUSI",
    "number": 107,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Management Accounting SS. 3 Credits. Offered in summer school only. Elements of accounting for management planning, budgeting, and control. Emphasis is on management uses of accounting information. Students may not receive credit for both BUSI 107 and BUSI 101 or 108. "
  },
  {
    "department": "BUSI",
    "number": 108,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Management Accounting CS. 3 Credits. Offered online by Continuing Studies. UNC-Chapel Hill business majors/minors may not take BUSI 108. May be taken before, after, or concurrently with BUSI 106. Elements of accounting for management planning, budgeting, and control. Emphasis is on management uses of accounting information. Students may not receive credit for both BUSI 108 and BUSI 101 or 107. "
  },
  {
    "department": "BUSI",
    "number": 188,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Foundations of Leadership: Discovering Your Strengths. 1.5 Credit. This course introduces the concepts of strengths-based leadership development to help uncover strengths and maximize potential for overall success. Students will learn how to connect these strengths to all areas of life, including, but not limited to, their academic journey as well as their future career path. "
  },
  {
    "department": "BUSI",
    "number": 189,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Introduction to Careers in Business. 1.5 Credit. This course gives students an overview of the career options in business. This overview provides an understanding of the foundations of business and allows students to reflect on what specific business areas they might want to pursue. "
  },
  {
    "department": "BUSI",
    "number": 201,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Business in Europe. 0.5-15 Credits. Business in Europe Repeat rules: May be repeated for credit. 15 total credits. 4 total completions. "
  },
  {
    "department": "BUSI",
    "number": 202,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Business in East Asia. 0.5-15 Credits. Business in East Asia Repeat rules: May be repeated for credit. 15 total credits. 4 total completions. "
  },
  {
    "department": "BUSI",
    "number": 203,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Business in South Asia. 0.5-15 Credits. Business in South Asia Repeat rules: May be repeated for credit. 15 total credits. 4 total completions. "
  },
  {
    "department": "BUSI",
    "number": 204,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Business in Latin America. 0.5-15 Credits. Business in Latin America Repeat rules: May be repeated for credit. 15 total credits. 4 total completions. "
  },
  {
    "department": "BUSI",
    "number": 205,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Business in the Middle East. 0.5-15 Credits. Business in the Middle East Repeat rules: May be repeated for credit. 15 total credits. 4 total completions. "
  },
  {
    "department": "BUSI",
    "number": 206,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Business in Africa. 0.5-15 Credits. Business in Africa Repeat rules: May be repeated for credit. 15 total credits. 4 total completions. "
  },
  {
    "department": "BUSI",
    "number": 207,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Business in Oceania. 0.5-15 Credits. Business in Oceania Repeat rules: May be repeated for credit. 15 total credits. 4 total completions. "
  },
  {
    "department": "BUSI",
    "number": 401,
    "modifier": "",
    "gen eds": "CI. ",
    "requirements": "",
    "description": "Management and Corporate Communication. 3 Credits. Open to business majors. Writing- and speaking-intensive course that emphasizes professional communication. Provides opportunities to learn and apply the conventions and expectations for standard business documents and presentations. Features strategies for addressing informative, persuasive, and bad-news messages using a variety of media (print documents, electronic messages, and oral presentations). "
  },
  {
    "department": "BUSI",
    "number": 403,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Operations Management. 3 Credits. Analysis of the operations functions in both manufacturing and service organizations. Formulating operational policies that improve efficiency and support high-level business strategy. Developing remedies that mitigate uncertainty and variability in operational processes. "
  },
  {
    "department": "BUSI",
    "number": 404,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "The Legal and Ethical Environment of Business. 1.5 Credit. An introduction to the legal system and an examination of ethical issues that affect business. Repeat rules: May be repeated for credit; may be repeated in the same term for different topics; 3 total credits. 2 total completions. "
  },
  {
    "department": "BUSI",
    "number": 405,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Leading and Managing: An Introduction to Organizational Behavior. 3 Credits. An introduction to leading and managing in organizations. Examines the impact of individual, group, and organizational factors on organizational performance and employee attitudes. Topics include leadership, perceptions, attitudes, motivation, group development, norms and cohesiveness, empowerment, conflict, negotiations, culture, structure, stress, innovation, and change. "
  },
  {
    "department": "BUSI",
    "number": 406,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Marketing. 3 Credits. Introduction to marketing with emphasis on the social and economic aspects of distribution, consumer problems, marketing functions and institutions, marketing methods and policies. "
  },
  {
    "department": "BUSI",
    "number": 407,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Financial Accounting and Analysis. 3 Credits. Students will acquire the tools to understand and analyze information presented in corporate financial statements. Financial accounting results and projected results are utilized in virtually every segment of the business world. Knowledge of financial accounting and analysis is necessary for managers, investors, bankers, financial analysts, and professional accountants. "
  },
  {
    "department": "BUSI",
    "number": 408,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisites, BUSI 101 and ECON 101. ",
    "description": "Corporate Finance. 3 Credits. Theoretical foundations of optimal financial policy. Problems and cases provide application of theory to financial decisions involving cash flow, capital structure, capital budgeting. "
  },
  {
    "department": "BUSI",
    "number": 409,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, BUSI 408. ",
    "description": "Advanced Corporate Finance. 1.5 Credit. A follow-up course to BUSI 408 that goes more deeply into the theory and application of financial management. Emphasis is placed on investment, financing, and dividend decisions. Honors version available "
  },
  {
    "department": "BUSI",
    "number": 410,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, STOR 155. ",
    "description": "Business Analytics. 3 Credits. While witnessing an explosion of data, most organizations tend to be awash with data but short on information. This course exposes students to techniques that will help them impact on an organization's strategy, planning, and operations, working on applications spanning a number of fields, including operations management, finance, and marketing. "
  },
  {
    "department": "BUSI",
    "number": 411,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Strategic Management at the Business Level. 1.5 Credit. Students analyze sources of competitive success in business organizations using case analysis and written reports to develop analytical reasoning skills for assessing forward looking opportunities for the company. The emphasis is on industry analysis and organizational analysis and the development and management of firm specific competencies for successful growth. Repeat rules: May be repeated for credit; may be repeated in the same term for different topics; 3 total credits. 2 total completions. "
  },
  {
    "department": "BUSI",
    "number": 412,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, BUSI 411. ",
    "description": "Strategic Management in the Modern Corporation. 1.5 Credit. Students study the development of alternate forms of corporate-level diversification, with an emphasis on understanding the varied paths of corporate development. There is a focus on the challenges of integrating activities across diversified corporations and the tools to manage firms through the transitions that signal a change in strategy. Repeat rules: May be repeated for credit; may be repeated in the same term for different topics; 3 total credits. 2 total completions. "
  },
  {
    "department": "BUSI",
    "number": 463,
    "modifier": "",
    "gen eds": "PH, CI. ",
    "requirements": "",
    "description": "Business and the Environment. 3 Credits. This course explores the intersection of business/economic growth and the major sustainability issues affecting the environment and societal well-being and raises questions about business ethics and the moral responsibility of business leaders, consumers, and citizens. Previously offered as ENEC 306. Honors version available "
  },
  {
    "department": "BUSI",
    "number": 490,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Business Topics. 1.5 Credit. Varied topics in business administration. Honors version available Repeat rules: May be repeated for credit; may be repeated in the same term for different topics; 9 total credits. 6 total completions. "
  },
  {
    "department": "BUSI",
    "number": 493,
    "modifier": "",
    "gen eds": "EE-Academic Internship. ",
    "requirements": "",
    "description": "Business Internship Project I. 3 Credits. Permission of the department. With prior approval, a student may propose and complete an academic research project (paper and presentation) derived from an internship experience. "
  },
  {
    "department": "BUSI",
    "number": 496,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Independent Study in Business. 1.5-3 Credits. Permission of the department. Supervised individual study and research in the student's special field of interest. Repeat rules: May be repeated for credit; may be repeated in the same term for different topics; 3 total credits. 2 total completions. "
  },
  {
    "department": "BUSI",
    "number": 500,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Entrepreneurship and Business Planning. 3 Credits. Students gain an understanding of entrepreneurship and the tools and skills necessary to conceive, plan, execute, and scale a successful new venture. Students develop business ventures in teams through an experiential pedagogy. Honors version available "
  },
  {
    "department": "BUSI",
    "number": 501,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, BUSI 406. ",
    "description": "Professional Selling Strategies and Skills. 3 Credits. Critical concepts and skills for selling products and services, and influencing others in business. Applicable to people considering sales or consulting as a career; to those thinking of starting an entrepreneurial company; or for those who want to understand how to influence peers, subordinates, and management. "
  },
  {
    "department": "BUSI",
    "number": 503,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Family Business I: Introduction to Family Enterprise. 1.5 Credit. Helps the student understand the evolutionary stages in the life of a family business and the challenges and opportunities that must be managed at each stage "
  },
  {
    "department": "BUSI",
    "number": 504,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, BUSI 500. ",
    "description": "Launching the Venture. 1.5 Credit. This is a cross-campus course for exceptional students, staff, and faculty, designed to help launch UNC-Chapel Hill start-ups. Only for students serious about launching in the next nine to 12 months. Admission by online application. More information at www.launch.unc.edu. Repeat rules: May be repeated for credit; may be repeated in the same term for different topics; 6 total credits. 4 total completions. "
  },
  {
    "department": "BUSI",
    "number": 505,
    "modifier": "",
    "gen eds": "EE-Field Work. ",
    "requirements": "",
    "description": "Consulting to Entrepreneurial Firms. 3 Credits. Student teams engage in consulting projects to help local start-ups tackle entrepreneurial challenges. Data is collected through fieldwork, such as client meetings, customer surveys, interviews with thought leaders, site visits, product tests, and/or focus groups. "
  },
  {
    "department": "BUSI",
    "number": 506,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, BUSI 408. ",
    "description": "Venture Capital and Start-Ups. 3 Credits. An introduction to the tools and skills necessary to recognize opportunities in high tech, biotech, and traditional start-ups. Local entrepreneurs come to class to pitch to students, who analyze the start-ups from the perspective of venture capitalists. "
  },
  {
    "department": "BUSI",
    "number": 507,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Sustainable Business and Social Entrepreneurship. 3 Credits. Examines what it means to pursue business success as measured by the triple-bottom line of people, planet, and profit. Focuses on strategies that companies implement to reduce environmental impact internally and through the supply chain. Examines the responsibility of business to employees, consumers, the local community, and society at large. Honors version available "
  },
  {
    "department": "BUSI",
    "number": 512,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Family Business II: Governance and Ownership. 1.5 Credit. Recommended preparation, completion of BUSI 503. Helps the student understand specific ownership, stewardship, tax, transition, and wealth management issues that affect family enterprises. "
  },
  {
    "department": "BUSI",
    "number": 514,
    "modifier": "",
    "gen eds": "EE-Field Work. ",
    "requirements": "Pre- or corequisite, BUSI 554. ",
    "description": "STAR. 4.5 Credits. Student Teams Achieving Results (STAR) is a live management consulting project that leverages and integrates UNC Kenan-Flagler course curricula. Teams of five to seven M.B.A. and undergraduate students and one faculty member work with major corporations or not-for-profit entities to solve a major strategic issue. Honors version available Repeat rules: May be repeated for credit. 9 total credits. 2 total completions. "
  },
  {
    "department": "BUSI",
    "number": 517,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, BUSI 408. ",
    "description": "Private Equity and Debt Markets. 1.5 Credit. The objective of this course is to examine the changing world of private equity investments today. This is a survey course and will help prepare you to work for private equity and venture capital funds or to work for investment banks. "
  },
  {
    "department": "BUSI",
    "number": 518,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisites, BUSI 502 and 517. ",
    "description": "Applied Private Equity. 3 Credits. Permission of the instructor. Explores, at a very advanced level, all stages of the management of a venture capital and private equity fund, from capital formation, deal sourcing, due diligence, monitoring and adding value, and exiting of a portfolio company. Honors version available Repeat rules: May be repeated for credit. 9 total credits. 3 total completions. "
  },
  {
    "department": "BUSI",
    "number": 519,
    "modifier": "",
    "gen eds": "EE-Field Work. ",
    "requirements": "",
    "description": "STAR--Global. 4.5 Credits. A global, live management consulting project that integrates other curricula and students (UNC and beyond). Teams of graduate and undergraduate students and one faculty member work to solve a major strategic issue. Team members participate in a three-day training weekend, virtual teaming, and two weeks of in-country project work. Honors version available Repeat rules: May be repeated for credit. 9 total credits. 2 total completions. "
  },
  {
    "department": "BUSI",
    "number": 520,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Advanced Spreadsheet Modeling for Business. 3 Credits. Primarily an online class. Use critical thinking and advanced Excel features to create spreadsheet models of common business problems. Topics include flexible design, problem solving, statistical analysis, charting, logic, reference functions, financial analysis, organizing data for complex analysis, what-if analysis, enhanced decision-making tools, troubleshooting workbooks, and VBA. "
  },
  {
    "department": "BUSI",
    "number": 524,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Applied Improvisation for Business Communication. 3 Credits. Focuses on improving students' soft skills, such as presenting, expressiveness, and interviewing, by applying the principles and techniques of improvisational theater. Participants explore creativity, adaptation, awareness, self-confidence, risk taking, physicality, intuition, and teamwork. Students can stretch their abilities and discover things about themselves and others that are crucial to success. "
  },
  {
    "department": "BUSI",
    "number": 525,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, BUSI 401. ",
    "description": "Advanced Business Presentations. 1.5 Credit. This course is grounded in argument, persuasion, and visual rhetoric to give students skills needed to develop winning presentations. Students learn strategies to help their messages \"stick\" with their audiences and to develop slide decks for the boardroom and advanced media devices. The course emphasizes efficiency in presentation preparation. "
  },
  {
    "department": "BUSI",
    "number": 526,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Leadership in Action. 3 Credits. Permission of the department. Provides student leaders with practical leadership frameworks and tools; creates opportunities to apply these on the job as leaders; and provides individualized coaching, feedback, and mentoring.  This is an applied learning course taught by a seasoned practitioner designed to accelerate each student's development and growth. "
  },
  {
    "department": "BUSI",
    "number": 532,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, BUSI 403. ",
    "description": "Service Operations. 3 Credits. Studies key challenges in effective service delivery through the analysis of staffing and scheduling, customer waiting, and revenue management. Case studies illustrate examples of effective service design and delivery in various service industries including professional services, banking, health care, hospitality, and entertainment. A simulation project is used. Honors version available "
  },
  {
    "department": "BUSI",
    "number": 533,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, BUSI 403. ",
    "description": "Supply Chain Management. 3 Credits. Analyzes the key drivers of supply chain performance including inventories, transportation, information technology, and sourcing. Studies strategies for supply chain coordination, and challenges and opportunities in global supply chains. A supply chain simulation is used. Honors version available "
  },
  {
    "department": "BUSI",
    "number": 534,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Business Modeling with Excel. 3 Credits. Provides a broad scope of analytic experience across corporate functions that is beneficial in consulting environments. "
  },
  {
    "department": "BUSI",
    "number": 536,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, BUSI 403. ",
    "description": "Project Management. 1.5 Credit. Permission of the department. This course prepares students to take part in and lead projects effectively. The goal is to equip individuals across any career concentration rather than extend the expertise of project-management specialists. Students may not receive credit for both BUSI 536 and MBA 710. "
  },
  {
    "department": "BUSI",
    "number": 537,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, BUSI 403. ",
    "description": "Retail Operations. 1.5 Credit. Permission of the department. Examines developments in retailing and operations management principles applicable to these developments. Topics: consumer behavior, demand forecasting, logistics and distribution, store execution, international retailing, internet-based retailing, performance assessment, and impact on financial performance. Students may not receive credit for both BUSI 537 and MBA 708. "
  },
  {
    "department": "BUSI",
    "number": 538,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, BUSI 403. ",
    "description": "Sustainable Operations. 1.5 Credit. This course explores the link between sustainability and the operations function of a firm. The course focuses on the following activities: product and process design; manufacturing; transportation; logistics and distribution; closed-loop/after-sales operations such as recycling, remanufacturing, and reuse; supply chain management. "
  },
  {
    "department": "BUSI",
    "number": 539,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, BUSI 403. ",
    "description": "Health Care Operations. 1.5 Credit. Permission of the department. Students apply principles and tools of operations management to explore improvement opportunities in the design, delivery, and management of the health care value chain. The course examines the health care operation from the perspective of operations metrics such as cost, quality, time (access), and variety/customization. "
  },
  {
    "department": "BUSI",
    "number": 545,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, BUSI 405. ",
    "description": "Negotiations. 1.5 Credit. This course enables students to develop their expertise in managing negotiations. It integrates existing theory and research with personal experiences and ideas. Using hands-on exercises, readings, and lively discussions, students build and hone their ability to understand, adapt to, and evaluate the personal, social, and situational dynamics of negotiations. "
  },
  {
    "department": "BUSI",
    "number": 554,
    "modifier": "",
    "gen eds": "",
    "requirements": "Pre- or corequisite, BUSI 408. ",
    "description": "Consulting Skills and Frameworks. 3 Credits. Permission of the instructor. The course is dedicated to teaching the core skills for success in consulting and business in general: teamwork, analysis, and presentations. Honors version available "
  },
  {
    "department": "BUSI",
    "number": 555,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, BUSI 405. ",
    "description": "Groups and Teams in Organizations. 1.5 Credit. Examines the design, management, and leadership of teams in organizational settings. Focus is on the interpersonal processes and structural characteristics that influence the effectiveness of teams, individual behavior in face-to-face interactions, and the dynamics of interpersonal relationships. "
  },
  {
    "department": "BUSI",
    "number": 562,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, BUSI 406. ",
    "description": "Consumer Behavior. 3 Credits. Review of conceptual models and empirical research in consumer behavior. Topics include decision processes, social and cultural influences, information processing, and ethical issues. "
  },
  {
    "department": "BUSI",
    "number": 564,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, BUSI 406. ",
    "description": "New Product Development. 3 Credits. The course concentrates on the fuzzy front end of the innovation process, focusing on tools and techniques to uncover consumer insights (needs). The design thinking process is emphasized as part of a semester-long team project. Other topics explored include creativity, intellectual property basics, prototyping, and Innovation 2.0. "
  },
  {
    "department": "BUSI",
    "number": 566,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, BUSI 406. ",
    "description": "Marketing Strategy. 3 Credits. The objective of this course is to understand and practice the strategic decision-making process in a dynamic competitive environment. The course builds on the foundations of marketing, and is based on lectures, cases, and computer simulations. "
  },
  {
    "department": "BUSI",
    "number": 568,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisites, BUSI 406 and 410. ",
    "description": "Marketing Analysis and Decision Making. 3 Credits. Marketing analytics is a systematic approach to harnessing these data to drive effective marketing decision making. We will learn to analyze historical data, market research data, and competitive information for making strategic marketing decisions. This course will be extensively based on case analysis and hands-on exercises. "
  },
  {
    "department": "BUSI",
    "number": 572,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, BUSI 570. ",
    "description": "Business Taxation. 1.5 Credit. Permission of the department. Required in spring semester for senior B.S.B.A.s who are admitted to the Kenan-Flagler Master of Accounting Program. Provides students with an initial understanding of the basic framework of the United States income tax system as it applies to businesses. "
  },
  {
    "department": "BUSI",
    "number": 580,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, BUSI 408. ",
    "description": "Investments. 3 Credits. A survey of investment principles and practices. Emphasis is given to the problems of security analysis and portfolio management with special attention to the investment problems of the individual investor. Honors version available "
  },
  {
    "department": "BUSI",
    "number": 582,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, BUSI 408. ",
    "description": "Mergers and Acquisitions. 3 Credits. Through lectures, case studies, and guest speakers, this course will cover all aspects of mergers and acquisitions from strategy to post-merger integration with an emphasis on valuation. Related activities such as hostile takeovers, private equity deals, and international acquisitions will also be discussed. Honors version available "
  },
  {
    "department": "BUSI",
    "number": 583,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisites, BUSI 407, 408, 520, and 580. ",
    "description": "Applied Investment Management. 3 Credits. Permission of the department. Year-long course. A live, student-managed investment fund with real dollars and fiduciary responsibility to the UNC Foundation. Emphasis is on the decisions that must be made by and/or for the ultimate investor and the analytic tools and empirical evidence that can help inform such decisions. Honors version available "
  },
  {
    "department": "BUSI",
    "number": 584,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, BUSI 408. ",
    "description": "Financial Modeling. 3 Credits. Skill development in constructing financial models for analyzing problems with decisions faced by financial professionals. Analyzing historical performance, forecasting free cash flows, estimating discount rates, determining terminal value, identifying other sources of value, and interpreting results in a dynamic setting. "
  },
  {
    "department": "BUSI",
    "number": 585,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Introduction to Real Estate. 3 Credits. An overview of residential and commercial real estate. This survey course examines 1) buying a house and constructing a portfolio of single-family rental houses, 2) commercial real estate product types, 3) amortization, cash flows, capital expenditures, cap rates, debt and equity, hurdle rates and taxes, 4) investment analysis, 5) acquisition, development, operation, and disposition, 6) real estate and contract law, and 7) the partnership negotiation process. "
  },
  {
    "department": "BUSI",
    "number": 586,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, BUSI 408. ",
    "description": "Personal Finance. 1.5 Credit. Introduces and broadens the concept of personal finance and increases understanding of the process of accumulating and protecting personal wealth. Students learn to identify and analyze risk and return relationships, understand investment alternatives and how strategies develop as life situations mature, and gain understanding of retirement planning and effectively transferring wealth. "
  },
  {
    "department": "BUSI",
    "number": 587,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Investment Banking. 1.5 Credit. Permission of the instructor and confirmed offer of investment banking analyst internship or full-time job. This course prepares students for investment banking positions and internships. The focus of the class is on financial modeling, general knowledge of banking, and what it takes to succeed in the industry. Honors version available "
  },
  {
    "department": "BUSI",
    "number": 588,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, BUSI 408. ",
    "description": "Introduction to Derivative Securities and Risk Management. 1.5 Credit. Introduction to derivative securities instruments (options and futures) and applications in investments and corporate finance. Honors version available "
  },
  {
    "department": "BUSI",
    "number": 589,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, BUSI 408. ",
    "description": "Fixed Income. 1.5 Credit. The course covers traditional bonds and term structure concepts as well as fixed income derivatives and interest rate modeling. Honors version available "
  },
  {
    "department": "BUSI",
    "number": 590,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Business Seminar. 3 Credits. Completion of requisite core course(s) and permission of the instructor required. Selected topics in business administration presented in seminar format with students engaged in individual and team study under the supervision of a member of the faculty. Honors version available Repeat rules: May be repeated for credit; may be repeated in the same term for different topics; 9 total credits. 3 total completions. "
  },
  {
    "department": "BUSI",
    "number": 591,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, BUSI 408. ",
    "description": "Behavioral Finance. 1.5 Credit. Completion of BUSI 409 recommended. An abundance of evidence suggests that the standard economic paradigm, \"rational agents in an efficient market,\" does not adequately describe behavior in financial markets. This course will survey the evidence and use psychology to guide alternative theories of financial markets. Honors version available "
  },
  {
    "department": "BUSI",
    "number": 592,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisites, BUSI 601 and 603. ",
    "description": "Applied Private Equity: Real Estate. 1.5 Credit. Permission of the instructor. This course explores, at a very advanced level, all stages of the management of a real estate private equity fund: from capital formation, deal sourcing, due diligence, monitoring and adding value, and exiting of the fund's real estate holdings. Repeat rules: May be repeated for credit; may be repeated in the same term for different topics; 9 total credits. 6 total completions. "
  },
  {
    "department": "BUSI",
    "number": 593,
    "modifier": "",
    "gen eds": "EE-Academic Internship. ",
    "requirements": "",
    "description": "Business Internship Project II. 3 Credits. Permission of the department. This course provides students with a format for reflection while performing a professional internship that enhances their ability to achieve career objectives. Repeat rules: May be repeated for credit. 6 total credits. 2 total completions. "
  },
  {
    "department": "BUSI",
    "number": 598,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisites, BUSI 408, and 580 or 588. ",
    "description": "Alternative Investments. 1.5 Credit. Permission of the instructor. Open to seniors only. Exposes students to the benefits, opportunities, and risks of incorporating alternative investments into managed institutional investment portfolios, including pension funds, endowments, and foundations. "
  },
  {
    "department": "BUSI",
    "number": 600,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, BUSI 408. ",
    "description": "Risk Management. 1.5 Credit. Permission of the instructor. Open to seniors only. Develops methods for applied analysis of financial and operational risk. "
  },
  {
    "department": "BUSI",
    "number": 601,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, BUSI 408. ",
    "description": "Real Estate Finance. 1.5 Credit. This course will focus on the different ways to finance real property, and how different financing techniques impact the feasibility and investment benefits for equity investors. Honors version available "
  },
  {
    "department": "BUSI",
    "number": 602,
    "modifier": "",
    "gen eds": "",
    "requirements": "Corequisite, BUSI 408. ",
    "description": "Strategic Economics. 1.5 Credit. This course focuses on decision making in the presence of strategic interaction. Students will apply game theory to yield insights into business decisions. Topics covered include pricing, entry, product market competition, first-mover advantage, capital budgeting, antitrust law, corporate governance, auctions, and mergers. "
  },
  {
    "department": "BUSI",
    "number": 603,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisites, BUSI 408 and 585. ",
    "description": "Real Estate Development. 1.5 Credit. This course is designed to introduce undergraduate students to the financial and economic analysis of real estate development. The course will focus on both the physical and financial dimensions of the real estate development process. The course considers multiple asset classes, and students learn to complete financial analysis of real estate development projects. "
  },
  {
    "department": "BUSI",
    "number": 604,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, BUSI 408. ",
    "description": "Real Estate and Capital Markets. 1.5 Credit. Introduces students to the capital markets for financing real estate assets. Topics include an overview of real estate as an asset class in the US economy, risk and return in real estate markets, the economics of discount and capitalization rates, the market for mortgage-backed securities (with a peek into the role that these instruments played in the recent financial crisis), and the valuation/analysis of Real Estate Investment Trusts (REITs). Honors version available "
  },
  {
    "department": "BUSI",
    "number": 610,
    "modifier": "",
    "gen eds": "GL. ",
    "requirements": "",
    "description": "Global Environment of Business. 3 Credits. Issues in operating overseas, including analyses of differences in country settings, legal and economic systems, and governmental policies affecting foreign operations. Studies trade theory, country groupings, and financial issues; managing operations in foreign lands; exporting. "
  },
  {
    "department": "BUSI",
    "number": 611,
    "modifier": "",
    "gen eds": "GL. ",
    "requirements": "",
    "description": "International Development. 3 Credits. Poverty is part of life for most of the world's population, with half living on less than two dollars a day. Course focuses on understanding this from a business school perspective. Looks at institutional failures that contribute to persistent poverty and the multiple roles managers can play in reducing poverty. "
  },
  {
    "department": "BUSI",
    "number": 617,
    "modifier": "",
    "gen eds": "GL. ",
    "requirements": "Prerequisite, BUSI 406. ",
    "description": "Global Marketing. 3 Credits. Examination of the problems involved in marketing products and services across national boundaries. Problem issues include culture, ideology, economics, technical standards, and currency movements. "
  },
  {
    "department": "BUSI",
    "number": 618,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, BUSI 408. ",
    "description": "Global Financial Markets. 1.5 Credit. Develops the foundation for financial decisions in a global economic environment. Extends the analytical concepts and tools learned in introductory investment and corporate finance courses to multicountry/multicurrency settings. Covers three major areas: the economics of exchange rates, international money and capital markets, and international corporate finance. "
  },
  {
    "department": "BUSI",
    "number": 623,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Global Entrepreneurship I. 1.5 Credit. The course ranges from developing the creative mindset, ideation, development/manufacturing, marketing, selling, and managing. The course places heavy emphasis on doing and collaborating rather than listening passively: 1) dream: design process, 2) think: feasibility, 3) create: product development and manufacturing, and 4) tell: marketing. Restricted to GLOBE students. "
  },
  {
    "department": "BUSI",
    "number": 624,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Global Entrepreneurship II. 3 Credits. The course ranges from developing the creative mindset, ideation, development/manufacturing, marketing, selling, and managing. The course places heavy emphasis on doing and collaborating rather than listening passively. 1) sell: sales; 2) run: management, finance and fundraising; and 3) launch Chapel Hill projects. Restricted to GLOBE students. "
  },
  {
    "department": "BUSI",
    "number": 650,
    "modifier": "",
    "gen eds": "EE-Field Work. ",
    "requirements": "",
    "description": "Symposium Core Committee. 1.5-3 Credits. Permission of the instructor. Service on the B.S.B.A. Symposium Core Committee to plan, execute, and evaluate the annual event. "
  },
  {
    "department": "BUSI",
    "number": 653,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Applied Learning: Symposium Core Committee. 1.5 Credit. Permission of the department. This course is by invitation only to students who previously served on the Undergraduate Business Symposium core committee. As senior advisors, students practice the leadership, organization, delegation, communication, and teamwork skills that they learn about in their other courses. Repeat rules: May be repeated for credit. 3 total credits. 2 total completions. "
  },
  {
    "department": "BUSI",
    "number": 688,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisites, BUSI 408 and 588. ",
    "description": "Applied Derivatives. 1.5 Credit. This seminar style course develops a set of financial tools useful for trading primary and derivative securities with the goal of obtaining specific exposures in equity, fixed income, and commodity markets. The course examines methods for managing financial price risk of positions and how hedge funds use derivatives in practice. Honors version available Repeat rules: May be repeated for credit. 3 total credits. 2 total completions. "
  },
  {
    "department": "BUSI",
    "number": 691,
    "modifier": "H",
    "gen eds": "",
    "requirements": "",
    "description": " Honors Research Proposal. 3 Credits. Permission of the department. Open to senior business administration majors with a minimum 3.5 grade point average in business courses. Students learn business research techniques and develop individual proposals for business research. Successful proposals may advance to honors thesis research and writing (BUSI 692H). Repeat rules: May be repeated for credit. 6 total credits. 2 total completions. "
  },
  {
    "department": "BUSI",
    "number": 692,
    "modifier": "H",
    "gen eds": "EE-Mentored Research. ",
    "requirements": "Prerequisite, BUSI 691H. ",
    "description": " Honors Thesis. 3 Credits. Permission of the department. Open to senior business majors with a minimum 3.5 grade point average in business courses. Original investigation of a topic in business and preparation of a substantive research project under the direction of a faculty advisor. Written essay and oral presentation are required. "
  },
  {
    "department": "EDUC",
    "number": 65,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "irst-Year Seminar: School Daze: What's School Got to do with Getting an Education?. 3 Credits. This seminar explores the concepts of schooling and education. Students will be challenged to reconsider their experiences and notions about pre-K through 12 schooling and to examine alternatives. "
  },
  {
    "department": "EDUC",
    "number": 89,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "irst-Year Seminar: Special Topics. 3 Credits. Course content will vary each semester. Repeat rules: May be repeated for credit; may be repeated in the same term for different topics; 6 total credits. 2 total completions. "
  },
  {
    "department": "EDUC",
    "number": 121,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Tutoring in the Schools I. 2 Credits. Provides a basic introduction to teaching and education. This course consists of a seminar based with field placements in different levels of schools. "
  },
  {
    "department": "EDUC",
    "number": 122,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Tutoring in the Schools II. 1 Credit. Combines tutoring training with a field placement for tutoring in literacy and mathematics in grades kindergarten through three. "
  },
  {
    "department": "EDUC",
    "number": 130,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Navigating the Research University. 1 Credit. This course will provide students with knowledge to succeed at a research university. Students will consider what it means to have a liberal arts education and will learn about motivation, resiliency, and self-advocacy. Students will reflect on their current work toward academic success and their path to graduation. "
  },
  {
    "department": "EDUC",
    "number": 131,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Career Exploration. 1 Credit. Provides students an opportunity for exploration of career choices. "
  },
  {
    "department": "EDUC",
    "number": 132,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Career Planning. 1 Credit. This course is designed for juniors and seniors who are preparing to embark on their post-Carolina job search. Students will learn how to develop the necessary tools and skills required to execute an effective job search. "
  },
  {
    "department": "EDUC",
    "number": 181,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Introduction to Human Development and Family Studies. 3 Credits. Introduces students to theories and major research areas in human development and family studies while connecting this theory and research to careers in the helping professions. Students shadow a professional in a field of their choice. "
  },
  {
    "department": "EDUC",
    "number": 190,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Special Topics in Education. 1-3 Credits. This course provides students the opportunity for introductory exploration and discussion of selected topics in education. Repeat rules: May be repeated for credit; may be repeated in the same term for different topics; 15 total credits. 5 total completions. "
  },
  {
    "department": "EDUC",
    "number": 221,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Tutoring in the Schools III. 1 Credit. Combines tutoring training with a field placement for tutoring in literacy and mathematics in grades four through eight. "
  },
  {
    "department": "EDUC",
    "number": 222,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Tutoring in the Schools IV. 1 Credit. Focuses on the relationship among arts, creativity, and education. "
  },
  {
    "department": "EDUC",
    "number": 231,
    "modifier": "",
    "gen eds": "SS, CI. ",
    "requirements": "",
    "description": "Thrive@Carolina and Beyond. 3 Credits. Learn about the science of thriving and strengths-based strategies for young adult development. The course will bridge contemporary literature on positive psychology (e.g., hope, optimism), developmental assets, resiliency, cultural competence, engagement/connectedness, positive youth development, and more. In particular, learn and work on thriving as a student at UNC-Chapel Hill. "
  },
  {
    "department": "EDUC",
    "number": 250,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Risk and Resiliency: Challenges and Opportunities in Education. 4 Credits. Explores factors that put children at risk for educational failure and interventions to increase resiliency. Service and learning experiences in educational and community agencies are integral to the course. "
  },
  {
    "department": "EDUC",
    "number": 301,
    "modifier": "",
    "gen eds": "SS, EE-Field Work. ",
    "requirements": "",
    "description": "Junior Transfer Seminar - Thriving in Transition. 3 Credits. Course challenges students to think critically about educational issues as they transition to a research university. Through readings, videos and activities, students explore the value of higher education, the development of intelligence, and the role of habit and happiness in college success. Students also conduct and present original qualitative research. "
  },
  {
    "department": "EDUC",
    "number": 309,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "An Examination of Quality and the Pursuit of Betterness. 3 Credits. A three-credit seminar on leadership styles, philosophies, and issues related to leadership. Each class will overlap these concepts (topical or theory/practice, service, and self-awareness.) "
  },
  {
    "department": "EDUC",
    "number": 316,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Advanced Leadership Development Seminar. 3 Credits. This is a three-credit course with a focus on delving deeper into issues relevant to leadership and education. This course is open to seniors, juniors, and sophomores with student organization experience and an interest in an advanced exploration of leadership. "
  },
  {
    "department": "EDUC",
    "number": 317,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Dynamics of Effective Leadership. 1 Credit. The course is intended to provide an introduction to leadership theory, a forum for reflection upon personal strengths and contributions to leadership, and an opportunity to explore the nature of working in teams and groups. "
  },
  {
    "department": "EDUC",
    "number": 318,
    "modifier": "",
    "gen eds": "EE-Mentored Research. ",
    "requirements": "",
    "description": "Peer Leadership in the University Environment. 2 Credits. This course revolves around and centers on the Relational Leadership Model which defines leadership as the relational and ethical process of people together attempting to accomplish positive change. "
  },
  {
    "department": "EDUC",
    "number": 330,
    "modifier": "",
    "gen eds": "SS. ",
    "requirements": "",
    "description": "The Science of Learning. 3 Credits. Students study several facets of learning in the modern world, and investigate what scholarship in cognitive psychology, educational psychology, and the learning sciences can do to help us maximize that learning. "
  },
  {
    "department": "EDUC",
    "number": 387,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Peer Tutoring. 3 Credits. Peer Tutoring is an APPLES service-learning course that provides undergraduates the opportunity to serve fellow students through tutoring. Tutors must have an overall GPA of 3.0 or higher. Repeat rules: May be repeated for credit. 6 total credits. 2 total completions. "
  },
  {
    "department": "EDUC",
    "number": 390,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Special Topics in Education. 3 Credits. This course provides students the opportunity for intensive exploration and discussion of selected topics in education. Repeat rules: May be repeated for credit; may be repeated in the same term for different topics. "
  },
  {
    "department": "EDUC",
    "number": 400,
    "modifier": "",
    "gen eds": "EE-Service Learning. ",
    "requirements": "",
    "description": "Autism in Our Communities: An Interdisciplinary Perspective. 3 Credits. Students have 30 hours of service-learning with individuals with autism at community partner sites. Class discussions introduce students to diverse topics related to autism spectrum disorder. This is an APPLES course. "
  },
  {
    "department": "EDUC",
    "number": 401,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Introduction to Early Childhood Development: Birth to Eight. 3 Credits. This course examines the field of child development as it contributes to the teaching and learning of children in early childhood and elementary educational settings, ages birth to eight. "
  },
  {
    "department": "EDUC",
    "number": 402,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Models of Early Childhood Service Delivery. 3 Credits. This seminar serves as an introduction to the field of child development and early childhood education and special education. Students learn about the primary professional disciplines and agencies serving young children and their families. Current policy, recommended practices, and research innovations are reviewed. "
  },
  {
    "department": "EDUC",
    "number": 403,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Families, Schools, and Community Services. 3 Credits. This course examines issues of diversity among and across families, in order to better prepare students for human service fields in a variety of settings such as clinics, schools, advocacy, and other organizations. "
  },
  {
    "department": "EDUC",
    "number": 404,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, EDUC 401. ",
    "description": "Infant/Toddler Assessment and Intervention. 3 Credits. Restricted to majors. Permission of the instructor for nonmajors. Provides students with knowledge of program models and curricula/intervention strategies for working with infants and toddlers with and without disabilities. Information is provided regarding identification and assessment strategies for infants, toddlers, and two-year-olds. Program models for working with families are emphasized. "
  },
  {
    "department": "EDUC",
    "number": 408,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Research Methods in Human Development. 3 Credits. An introductory examination of human development and family research methods designed to provide an understanding of scientific inquiry, methodology, measurement, test construction, scaling, and statistical terms and techniques. "
  },
  {
    "department": "EDUC",
    "number": 410,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Promotive Youth Services in Community and School Environments. 3 Credits. This course is an exploration of the research and theory about programs that promote youth development and prevent youth problems in the central contexts where youth function (i.e., home, school, outside of school activities, sports, peer networks, etc.). Career options (e.g., social work, law enforcement, teaching, and community outreach work) will also be explored in real life work settings. "
  },
  {
    "department": "EDUC",
    "number": 413,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Language and Literacy Learning. 3 Credits. Permission of the instructor for nonmajors. This course covers the theoretical and developmental aspects of language and literacy processes and practices. The course will cover reading, writing, speaking, listening and viewing practices, birth to age 12. "
  },
  {
    "department": "EDUC",
    "number": 416,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Curriculum Integration: Science, Math, and Technology. 3 Credits. Permission of the instructor for nonmajors. The focus of this course is children's development in mathematical and scientific ways of knowing and the use of technology to support this development. "
  },
  {
    "department": "EDUC",
    "number": 421,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Community Organizations and Children I. 1 Credit. Provides an understanding of the community contexts of schools and an experience working in community group. This is the first semester of two-semester course. "
  },
  {
    "department": "EDUC",
    "number": 422,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, EDUC 421. ",
    "description": "Community Organizations and Children II. 1 Credit. Provides prospective teachers with an understanding of the community contexts of the schools. Second semester of a two-semester course. "
  },
  {
    "department": "EDUC",
    "number": 441,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Education in American Society. 3 Credits. A reflective examination of beliefs and attitudes associated with 1) the historical, philosophical, sociological, political, and economic forces affecting education and schooling in the United States; 2) the structure and function of the school system; and 3) current issues and trends in American schooling and education. "
  },
  {
    "department": "EDUC",
    "number": 464,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Teaching Profession. 3 Credits. Introduction to teaching. Course covers foundations and philosophies of education, current issues, and trends in public schooling. "
  },
  {
    "department": "EDUC",
    "number": 465,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Introduction to Teaching. 2 Credits. Offered concurrently with EDUC 466. Restricted to students admitted to the middle grades teacher education program. Initiates students into the teaching profession. The course stresses what it is like to be a teacher, with concurrent emphasis on the life of the student and the study of schools. "
  },
  {
    "department": "EDUC",
    "number": 466,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Planning for Teaching in the Middle Grades. 3 Credits. Offered concurrently with EDUC 465. Restricted to students admitted to the middle grades teacher education program. Helps students learn how to plan and develop skills to meet the unique and diverse needs of young adolescents as they prepare to teach. "
  },
  {
    "department": "EDUC",
    "number": 469,
    "modifier": "",
    "gen eds": "EE-Field Work. ",
    "requirements": "Prerequisites, EDUC 465 and 466. ",
    "description": "Developing Skills for Teaching. 3 Credits. Helps students develop a variety of basic teaching skills used by classroom teachers. This course will be conducted primarily as a laboratory course. "
  },
  {
    "department": "EDUC",
    "number": 493,
    "modifier": "",
    "gen eds": "EE-Field Work. ",
    "requirements": "",
    "description": "Practicum. 1-6 Credits. Permission of the instructor for nonmajors. Students gain familiarity with the operations and complexity of teaching. Students observe instruction, assist in teaching, learn about the curriculum and specific resources, interact with school personnel, work with students, and apply skills learned in previous courses. Prepares students for internship or student teaching. Repeat rules: May be repeated for credit; may be repeated in the same term for different topics. "
  },
  {
    "department": "EDUC",
    "number": 496,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Independent Study. 1-3 Credits. Permission of the instructor. Provides readings and research under the direction of a faculty member. May be repeated for a maximum of six credit hours. Repeat rules: May be repeated for credit; may be repeated in the same term for different topics; 12 total credits. 4 total completions. "
  },
  {
    "department": "EDUC",
    "number": 503,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Leadership Seminar. 1-3 Credits. Course asks students to consider what it means to participate in schools as educational leaders. Students consider how to collaborate effectively with school colleagues, advocate for children and families, participate in the politics of schools and education, and examine what it means to be change agents in classrooms and schools. "
  },
  {
    "department": "EDUC",
    "number": 504,
    "modifier": "",
    "gen eds": "SS. ",
    "requirements": "",
    "description": "Learning in the Modern World. 3 Credits. Students learn about current educational emphases and controversies as well as what the research and scholarship in the fields of education and cognition can contribute to our understanding of these phenomena. "
  },
  {
    "department": "EDUC",
    "number": 505,
    "modifier": "",
    "gen eds": "SS. ",
    "requirements": "",
    "description": "Leadership in Educational/Nonprofit Settings. 3 Credits. Introduces students to a research-based, highly practical understanding of leadership frames/styles prominent in educational/nonprofit organizations. Emphasizes continued student engagement with various leadership models and principles. "
  },
  {
    "department": "EDUC",
    "number": 506,
    "modifier": "",
    "gen eds": "SS. ",
    "requirements": "",
    "description": "Politics, Policymaking, and America's Schools. 3 Credits. Through extensive case study and conversations with policy actors, students will learn the stages model of policy making and understand conflicting values that play out in policy decisions. "
  },
  {
    "department": "EDUC",
    "number": 508,
    "modifier": "",
    "gen eds": "SS, GL. ",
    "requirements": "",
    "description": "Equity, Leadership, and You. 3 Credits. This course was developed to confront and address questions of global cultural competence and self-critique. Culturally competent leaders work to understand their own biases and patterns of discrimination. "
  },
  {
    "department": "EDUC",
    "number": 509,
    "modifier": "",
    "gen eds": "SS. ",
    "requirements": "",
    "description": "Helping Youth Thrive in K-12 Schools. 3 Credits. Learn strengths-oriented approaches in education practice, research, and policy. The course takes up contemporary literature on positive psychology, developmental assets, resiliency, cultural competence, school readiness, school engagement/ connectedness, and positive youth development. "
  },
  {
    "department": "EDUC",
    "number": 510,
    "modifier": "",
    "gen eds": "HS, US. ",
    "requirements": "",
    "description": "Mexican American and Chicana/o Experience in Education. 3 Credits. This course examines the political, cultural, and historical dimensions of the Mexican American and Chicana/o experience in education. A critical exploration of K-12 schools, higher education, and various social initiatives intended to address inequities in education for Mexican Americans and Chicanas/os will also be a focus of this class. "
  },
  {
    "department": "EDUC",
    "number": 511,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Politics of Reading. 3 Credits. Course explores the politics and policies involved in literacy curriculum and pedagogy. Critical policy analysis is used as a tool to explore and understand the political issues involved in teaching young children to read and write. "
  },
  {
    "department": "EDUC",
    "number": 513,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Methods for Teaching in the Elementary School. 3-9 Credits. Permission of the instructor for nonmajors. This methods block is a field based, integrated collection of science, literacy, and math courses designed to prepare pre-service teachers for planning and implementing instruction in elementary schools. Repeat rules: May be repeated for credit; may be repeated in the same term for different topics. "
  },
  {
    "department": "EDUC",
    "number": 515,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "The Arts as Integrative Teaching. 2 Credits. Restricted to students admitted to the elementary education program or the child development and family studies program. Explores integration of the arts in the curriculum. "
  },
  {
    "department": "EDUC",
    "number": 516,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Introduction to the Education of Exceptional Learners. 3 Credits. Offers an overview of the special education field and its relevance to the classroom teacher. The course is based on an interdisciplinary perspective toward serving exceptional learners and collaboratively coordinating services. Course content emphasizes inclusive programming and the teacher's role in facilitating students' unique learning needs. "
  },
  {
    "department": "EDUC",
    "number": 519,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, EDUC 593. ",
    "description": "Senior Seminar. 3 Credits. Course is restricted to majors. Permission of the instructor for nonmajors. The senior seminar is inquiry based and directly connects student teachers with classroom practices. Throughout the semester student teachers develop and implement inquiry projects. "
  },
  {
    "department": "EDUC",
    "number": 520,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Early Language and Literacy Learning-Birth to Third Grade. 3 Credits. Course is restricted to majors. Permission of the instructor for nonmajors. Course focuses on the language, reading, and writing development of children birth through third grade. Promotes early literacy learning for all children with and without disabilities, including those at risk. "
  },
  {
    "department": "EDUC",
    "number": 521,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Schools, Cultures, and Communities I: Youth. 3 Credits. Focus on youth in schools. This course considers the history and present lives of youth, primarily as teenagers/adolescents. It seeks recognition and understanding of the uniqueness of their lives. "
  },
  {
    "department": "EDUC",
    "number": 522,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Schools, Cultures, and Communities II: Schools. 3 Credits. Course focuses on schools and educational issues as they relate to practices and policies. Fulfills central ideas of the minor in education in consideration of the history and present conditions of schooling in a democratic society. "
  },
  {
    "department": "EDUC",
    "number": 523,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Teaching Early Mathematics-Birth to Third Grade. 3 Credits. Course is restricted to majors. Permission of the instructor for nonmajors. Students study the teaching and learning of mathematics for young children, birth to third grade. Emphasis is placed on content for math, as well as materials, techniques, and teaching aids. "
  },
  {
    "department": "EDUC",
    "number": 524,
    "modifier": "",
    "gen eds": "EE-Field Work. ",
    "requirements": "",
    "description": "Learning on the Edge: Theories of Experiential Education. 3 Credits. This course examines experiential education in a variety of settings. Students will explore the role experiential education currently plays and suggest new roles in a chosen field of study. "
  },
  {
    "department": "EDUC",
    "number": 525,
    "modifier": "",
    "gen eds": "SS. ",
    "requirements": "",
    "description": "Human Abilities and Online Learning. 3 Credits. Learn about the scientific basis of thinking and learning and what this implies for guiding children and adults, for personal development and for building environments that help people learn and grow successfully in a rapidly changing technological world. "
  },
  {
    "department": "EDUC",
    "number": 526,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Ethics and Education: From Global Problems to Classroom Dilemmas. 3 Credits. Among the topics examined are ethical implications of democratic schooling for a democratic society, educators as moral agents, and education as an institution with incumbent responsibilities. Students explore the explicit and implied ethics of education and schooling as they relate to policy makers, educators, and citizens concerned about social justice. "
  },
  {
    "department": "EDUC",
    "number": 527,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Screen Education: Representations of Education in Popular Culture. 3 Credits. Explore and analyze how education has been represented in popular culture. \"Education\" refers to teachers, students, principals, other educators, and the everyday processes of schooling, and \"popular culture\" refers to school films (fictional films), school documentaries, television shows, music videos and song lyrics, animation, and other media forms. "
  },
  {
    "department": "EDUC",
    "number": 529,
    "modifier": "",
    "gen eds": "HS, CI. ",
    "requirements": "",
    "description": "Education in American Society. 3 Credits. Explore history of American schools to inform students' understandings of contemporary schools. Examine policies, issues, and controversies through a chronological examination of schools and society. "
  },
  {
    "department": "EDUC",
    "number": 531,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Effective Teaching: First Steps. 2 Credits. Characteristics of effective teachers, classroom management, instructional methods, instructional planning and presentation, monitoring and assessing student behavior and learning, differentiating instruction, yearly plans and pacing guides. "
  },
  {
    "department": "EDUC",
    "number": 532,
    "modifier": "",
    "gen eds": "SS. ",
    "requirements": "",
    "description": "Introduction to Development and Learning. 3 Credits. This course examines the field of human development as it contributes to the teaching and learning of all children. The emphasis is on understanding the nature of development in educational contexts and the implications of research and theory on human development for teacher practice and the creation of supportive learning environments for all children. "
  },
  {
    "department": "EDUC",
    "number": 533,
    "modifier": "",
    "gen eds": "SS, US. ",
    "requirements": "",
    "description": "Social Justice in Education. 3 Credits. Course examines how education can help create more fair and just societies, ultimately contributing to high performing educational systems internationally. Students explore multiple perspectives on social justice; examine efforts at local, state, national, and global levels; and learn to articulate efforts in classrooms and schools with wider community initiatives. "
  },
  {
    "department": "EDUC",
    "number": 534,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Effective Teaching: Assessment. 2 Credits. Methods of assessment, multiple measures, monitoring student performance to inform and improve instruction, understanding students with special needs with individual education plans, test scores, and other information in student files. "
  },
  {
    "department": "EDUC",
    "number": 535,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Teachers and Schools. 3 Credits. Leadership in classroom and school with families, standards of practice, advocating equity, supporting teaching profession, school organization, school finance, legal issue/education strategies for environments that promote learning, issues and trends. "
  },
  {
    "department": "EDUC",
    "number": 540,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Mathematics Teaching. 2 Credits. NCTM Standards, Standard Course of Study, developing student understanding of mathematics, problem-solving skills, and professional commitment. "
  },
  {
    "department": "EDUC",
    "number": 541,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Mathematics Problems for Instruction. 2 Credits. Mathematical tasks for learners in grades six through 12 and instructional methods necessary to maintain a task at a high cognitive level. "
  },
  {
    "department": "EDUC",
    "number": 542,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Planning for Mathematics Instruction. 2 Credits. Examining patterns of practice and assessment, modifying and improving planned units, pacing instruction, reconsidering individual differences and differentiation. "
  },
  {
    "department": "EDUC",
    "number": 550,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Science Teaching. 2 Credits. Nature of science, national science standards, teaching science as inquiry, safety in the science classroom, materials management. "
  },
  {
    "department": "EDUC",
    "number": 551,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, EDUC 550. ",
    "description": "Designing Science Tasks. 2 Credits. Developing and redesigning science instruction to engage students actively, with emphasis on classroom management for energetic curricula, modifying tasks and projects, assessment strategies, and utilization of resources. "
  },
  {
    "department": "EDUC",
    "number": 552,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, EDUC 551. ",
    "description": "Improving Science Instruction. 2 Credits. A practitioner's look at instruction in middle and high school science classrooms using many current pedagogical approaches of instruction: constructivism, models of inquiry, reflective practice, and conceptual change theory. "
  },
  {
    "department": "EDUC",
    "number": 555,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Constructive Coaching I: Starting Out Right. 1 Credit. Designed to support lateral entry candidates, solving the most urgent problems in the classroom. Includes frequent online communication, individualized attention to immediate problems and combines supervision, coaching, and mentoring. "
  },
  {
    "department": "EDUC",
    "number": 556,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, EDUC 555. ",
    "description": "Constructive Coaching II: Effective Management of Student Behavior. 1 Credit. Course designed to help lateral entry candidates by improving their classroom management skills, specifically those related to student behavior. "
  },
  {
    "department": "EDUC",
    "number": 557,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, EDUC 556. ",
    "description": "Constructive Coaching III: Helping Students Learn. 3 Credits. Course designed to support the lateral entry candidates through individualized feedback about concerns, focusing on strategies for increasing student learning using content area literacy strategies. "
  },
  {
    "department": "EDUC",
    "number": 560,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Second Language Teaching. 2 Credits. Methods of teaching a second language, how people learn foreign languages, planning instruction, getting students to communicate, using and adapting foreign language textbooks, and developing lessons. "
  },
  {
    "department": "EDUC",
    "number": 561,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Designing Second Language Tasks. 2 Credits. Students examine instruction as effective mechanism for classroom management, choosing and redesigning tasks and projects to engage students in active learning. Assessment of student understanding investigated as necessary for development of effective instruction. "
  },
  {
    "department": "EDUC",
    "number": 562,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Improving Second Language Instruction. 2 Credits. Students will consider national standards frameworks as organizing principles for instructional strategies. They will develop skills by use of culturally authentic materials, performance-based assessment, and units and lessons promoting successful language learning. "
  },
  {
    "department": "EDUC",
    "number": 563,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Teaching Language Arts in the Middle Grades. 3 Credits. Restricted to students admitted to the middle grades education program. Focuses on the goals and methods of teaching language arts in the middle grades, including planning for student diversity and unit planning. "
  },
  {
    "department": "EDUC",
    "number": 564,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Teaching Social Studies in the Middle Grades. 3 Credits. Restricted to students admitted to the middle grades education program. Focuses on the goals and methods of teaching social studies in the middle grades. "
  },
  {
    "department": "EDUC",
    "number": 565,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Teaching Science in the Middle Grades. 3 Credits. Restricted to students admitted to the middle grades education program. Focuses on methods for teaching science in the middle grades and includes emphasis on the individual needs of students, reading and writing in the content area, and unit planning. "
  },
  {
    "department": "EDUC",
    "number": 566,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Teaching Math in the Middle Grades. 3 Credits. Restricted to students admitted to the middle grades education program. Focuses on methods for teaching mathematics in the middle grades and includes emphasis on the individual needs of students, reading and writing in the content area, and unit planning. "
  },
  {
    "department": "EDUC",
    "number": 567,
    "modifier": "",
    "gen eds": "LA, CI. ",
    "requirements": "",
    "description": "Children's Literature in Elementary and Middle Schools. 3 Credits. Explores literature in the contexts of interdisciplinary elementary and middle school curricula and the interests and needs of children and young adolescents. Topics include reader-response theory, censorship, Internet resources, school resources, and methods. "
  },
  {
    "department": "EDUC",
    "number": 568,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisites, EDUC 465, 466, and 469; corequisite, EDUC 593. ",
    "description": "Seminar on Teaching. 3 Credits.  "
  },
  {
    "department": "EDUC",
    "number": 583,
    "modifier": "",
    "gen eds": "EE-Service Learning. ",
    "requirements": "",
    "description": "Planning the Internship Experience. 3 Credits. This course provides an integrative learning experience which prepares HDFS students to apply academic learning acquired in previous coursework to real-life situations likely to be encountered in the internship experience and throughout their careers in the field of human services. Course materials and learning experiences are intended to help students obtain an internship. "
  },
  {
    "department": "EDUC",
    "number": 593,
    "modifier": "",
    "gen eds": "EE-Academic Internship. ",
    "requirements": "",
    "description": "Internship/Student Teaching. 1-12 Credits. Internships are full-time, authentic, field-based experiences in an educational or professional setting. Preservice teachers are responsible for planning lessons, delivering instruction, assessing students, managing the classroom, and demonstrating their teaching effectiveness. All internships are devoted exclusively to the student's functioning in a professional capacity. Repeat rules: May be repeated for credit; may be repeated in the same term for different topics; 12 total credits. 2 total completions. "
  },
  {
    "department": "EDUC",
    "number": 595,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Introduction to Exceptional Children. 3 Credits. Permission of the instructor for nonmajors. Surveys giftedness and mental disabilities, emotional and behavioral disorders, learning disabilities, speech, hearing, vision, and physical impairments. Emphasizes the role of professionals, families, and the community in supporting the whole child. "
  },
  {
    "department": "EDUC",
    "number": 601,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Education Workshops. 1-3 Credits. Permission of the program director. Workshops designed around education topics primarily for licensed K-12 teachers. Repeat rules: May be repeated for credit; may be repeated in the same term for different topics; 12 total credits. 5 total completions. "
  },
  {
    "department": "EDUC",
    "number": 614,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Innovative and Engaging Teaching. 3 Credits. Introduction to the teaching profession including a focused, program-long emphasis on innovative, authentic, and resource-informed teaching. Includes engagement with 21st-century learning skills. "
  },
  {
    "department": "EDUC",
    "number": 615,
    "modifier": "",
    "gen eds": "EE-Field Work, US. ",
    "requirements": "",
    "description": "Schools and Community Collaboration. 3 Credits. Course explores the symbiotic relationship between schools, families, and communities through a historical and sociocultural lens. Students participate in a community-based field experience. "
  },
  {
    "department": "EDUC",
    "number": 616,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Teaching Early English Language Arts. 3 Credits. Course focuses on ELA pedagogy, grades kindergarten through second grade. Course emphasizes best practices in foundations of reading and writing, cross-disciplinary concepts, and meaningful inquiry-based learning experiences. "
  },
  {
    "department": "EDUC",
    "number": 617,
    "modifier": "",
    "gen eds": "SS, EE-Service Learning. ",
    "requirements": "",
    "description": "Teaching in the Middle School. 3 Credits. Provides students with an introduction to the history, philosophy, and attributes of schools and curriculum specifically designed for young adolescents with attention to their developmental characteristics and needs as learners. "
  },
  {
    "department": "EDUC",
    "number": 626,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Pedagogical English Grammar for ESL Teachers. 3 Credits. Enhances foreign and second language educators' understanding of English grammar, expands their skills in linguistic analysis, and helps them develop a more pedagogically sound approach to the teaching of English grammar. "
  },
  {
    "department": "EDUC",
    "number": 627,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Pedagogical Linguistics for ESL Teachers. 3 Credits. Provides future English as a second language teachers with advanced concepts in linguistics and comparative linguistics. Topics such as phonology and morphology will be covered. "
  },
  {
    "department": "EDUC",
    "number": 628,
    "modifier": "",
    "gen eds": "US. ",
    "requirements": "",
    "description": "Teaching English Language Learners. 3 Credits. Provides students with an introduction to the history, philosophy, and attributes of schools and curriculum specifically designed for young adolescents with attention to their developmental characteristics and needs as learners. "
  },
  {
    "department": "EDUC",
    "number": 629,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Language Minority Students: Issues for Practitioners. 3 Credits. Permission of the instructor. Explores issues of culture and language associated with teaching English as a second language. "
  },
  {
    "department": "EDUC",
    "number": 685,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Teaching Mathematics in the Elementary Grades. 3 Credits. This course emphasizes the interconnection of a classroom/school and society, the role of cultural beliefs in education, and mathematics instruction. "
  },
  {
    "department": "EDUC",
    "number": 686,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Teaching Science in the Elementary Grades. 3 Credits. This course emphasizes the interconnection of classroom/school and society, the role of cultural beliefs in education, and science instruction. "
  },
  {
    "department": "EDUC",
    "number": 687,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Teaching Social Studies in the Elementary Grades. 3 Credits. This course emphasizes the interconnection of classroom/school and society, the role of cultural beliefs in education, and social studies instruction. "
  },
  {
    "department": "EDUC",
    "number": 688,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Teaching Intermediate English Language Arts, Grades 3-6. 3 Credits. This course emphasizes the interconnection of classroom/school and society, the role of cultural beliefs in education, and English language arts instruction. "
  },
  {
    "department": "EDUC",
    "number": 689,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Foundations of Special Education. 3 Credits. This course provides an advanced introduction to key concepts, issues, and service delivery approaches pertaining to the educational needs of students with high incidence disabilities. "
  },
  {
    "department": "EDUC",
    "number": 691,
    "modifier": "H",
    "gen eds": "EE-Mentored Research. ",
    "requirements": "",
    "description": " Honors Seminar in Education. 3 Credits. Restricted to honors candidates in the School of Education. Required for graduation with honors in education. Integration of critical analysis of selected educational themes, introduction to methods of educational research, and intensive work in skills of reading critically and writing. "
  },
  {
    "department": "EDUC",
    "number": 693,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Practica Student Internship. 1-12 Credits. Provides students the opportunity to observe and become involved with all aspects of teaching and schools within their content area. Repeat rules: May be repeated for credit; may be repeated in the same term for different topics; 12 total credits. 2 total completions. "
  },
  {
    "department": "EDUC",
    "number": 694,
    "modifier": "H",
    "gen eds": "EE-Mentored Research. ",
    "requirements": "Prerequisite, EDUC 691H; A grade of B or better in EDUC 691H is required to take this course. ",
    "description": " Honors Thesis in Education. 3 Credits. Required of all candidates for graduation with honors in education. Preparation of an honors thesis under the direction of a member of the School of Education faculty and an oral examination on the thesis. "
  },
  {
    "department": "EDUC",
    "number": 697,
    "modifier": "",
    "gen eds": "EE-Mentored Research. ",
    "requirements": "",
    "description": "Education Minor Capstone Course. 3 Credits. Student completes a major project in education. Course involves discussion about the changing and contested goals of education, how student projects are implicated in these complexities, and how the projects may be articulated in terms of policy change. "
  },
  {
    "department": "INLS",
    "number": 73,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "irst-Year Seminar: Smart Cities. 3 Credits. Topics and trends in sustainable and smart cities. Role of information in the design of network resources and impact on urban design, development, and urban living will be explored. "
  },
  {
    "department": "INLS",
    "number": 89,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "irst-Year Seminar: Special Topics. 3 Credits. Special topics course; content will vary each semester. Repeat rules: May be repeated for credit; may be repeated in the same term for different topics; 6 total credits. 2 total completions. "
  },
  {
    "department": "INLS",
    "number": 151,
    "modifier": "",
    "gen eds": "SS. ",
    "requirements": "",
    "description": "Retrieving and Analyzing Information. 3 Credits. Introduction to and application of the processes that can be used in seeking information, evaluating the quality of the information retrieved, and synthesizing the information into a useful form. "
  },
  {
    "department": "INLS",
    "number": 161,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Tools for Information Literacy. 3 Credits. Tools and concepts for information literacy. Includes software use and maintenance, computer applications, and networked information systems. "
  },
  {
    "department": "INLS",
    "number": 201,
    "modifier": "",
    "gen eds": "SS. ",
    "requirements": "",
    "description": "Foundations of Information Science. 3 Credits. Examines the evolution of information science; information representation, organization and management; search and retrieval; human information seeking and interaction; organizational behavior and communication; policy, ethics and scholarly communication. "
  },
  {
    "department": "INLS",
    "number": 202,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, INLS 201. ",
    "description": "Retrieval and Organizing Systems. 3 Credits. Introduction to foundational core concepts and core techniques in information organization, information retrieval, and data mining. "
  },
  {
    "department": "INLS",
    "number": 203,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, INLS 201. ",
    "description": "Human Information Behavior. 3 Credits. Introduces key areas and concepts in information science, to include task modeling, information-seeking behavior, search behavior, human-computer interaction, usability, user interfaces, social media, and social media analysis. "
  },
  {
    "department": "INLS",
    "number": 318,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, INLS 382. ",
    "description": "Human Computer Interaction. 3 Credits. Design, implementation, and evaluation of interfaces for computer systems. User-based techniques, usability issues, and human factors. "
  },
  {
    "department": "INLS",
    "number": 382,
    "modifier": "",
    "gen eds": "",
    "requirements": "Pre- or corequisite, INLS 161. ",
    "description": "Information Systems Analysis and Design. 3 Credits. Analysis of organizational problems and how information systems can be designed to solve those problems. Application of database and interface design principles to the implementation of information systems.Students may not receive credit for both INLS 382 and INLS 582. "
  },
  {
    "department": "INLS",
    "number": 384,
    "modifier": "",
    "gen eds": "PH, CI. ",
    "requirements": "Prerequisite, INLS 201. ",
    "description": "Information and Computer Ethics. 3 Credits. Overview of ethical reasoning, followed by examination of ethical issues relevant to information science, including access to information and technology, societal impacts of technology, information privacy, surveillance and security, intellectual property, and professional ethics. "
  },
  {
    "department": "INLS",
    "number": 385,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Information Use for Organizational Effectiveness. 3 Credits. Basic concepts in the way that information, people, and technology interact to influence organizational effectiveness. Principles of problem solving, teamwork, leadership, and organizational change/innovation. "
  },
  {
    "department": "INLS",
    "number": 393,
    "modifier": "",
    "gen eds": "EE-Academic Internship. ",
    "requirements": "",
    "description": "Information Science Internship. 3 Credits. Permission of the school. Supervised observation and practice in information science. The internship typically takes place in an information agency or an information technology company. Faculty-led seminars and a paper enhance the experience. Pass/Fail only. "
  },
  {
    "department": "INLS",
    "number": 396,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Independent Study in Information Systems. 1-3 Credits. Study by an individual student on a special topic under the direction of a specific faculty member. A prospectus/plan for the work is required in advance of registration. Repeat rules: May be repeated for credit. 6 total credits. 2 total completions. "
  },
  {
    "department": "INLS",
    "number": 418,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, INLS 382. ",
    "description": "Human Factors in System Design. 3 Credits. Design, implementation, and evaluation of interfaces for computer systems. User-based techniques, usability issues, and human factors. "
  },
  {
    "department": "INLS",
    "number": 465,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Understanding Information Technology for Managing Digital Collections. 3 Credits. Prepares students to be conversant with information technologies that underlie digital collections in order to evaluate the work of developers, delegate tasks, write requests for proposals, and establish policies and procedures. Teaches students how to think about information technology systems and recognize and manage interdependencies between parts of the systems. "
  },
  {
    "department": "INLS",
    "number": 490,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Selected Topics. 1-3 Credits. Exploration of an introductory-level special topic not otherwise covered in the curriculum. Previous offerings of these courses do not predict their future availability; new courses may replace these. Repeat rules: May be repeated for credit; may be repeated in the same term for different topics; 9 total credits. 3 total completions. "
  },
  {
    "department": "INLS",
    "number": 500,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Human Information Interactions. 3 Credits. The behavioral and cognitive activities of those who interact with information, with emphasis on the role of information mediators. How information needs are recognized and resolved; use and dissemination of information. "
  },
  {
    "department": "INLS",
    "number": 501,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Information Resources and Services. 3 Credits. Analysis, use, and evaluation of information and reference systems, services, and tools for both printed and electronic delivery. Provides a foundation in electronic information search techniques, question negotiation, interviewing, and instruction. "
  },
  {
    "department": "INLS",
    "number": 502,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, INLS 501; permission of the instructor for students lacking the prerequisite. ",
    "description": "User Education. 3 Credits. Examines the history and context of LIS training programs. Pedagogy, teaching skills, methods of evaluation are addressed. Students may tailor learning projects to their own interests. "
  },
  {
    "department": "INLS",
    "number": 503,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Communication Skills for Information Professionals. 3 Credits. Through individual presentations, group exercises, and performance-centered feedback, this course seeks to improve students' ability to communicate their ideas clearly and present themselves positively in a professional setting. "
  },
  {
    "department": "INLS",
    "number": 509,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Information Retrieval. 3 Credits. Study of information retrieval and question answering techniques, including document classification, retrieval and evaluation techniques, handling of large data collections, and the use of feedback. "
  },
  {
    "department": "INLS",
    "number": 512,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, COMP 110, 116, or 121. ",
    "description": "Applications of Natural Language Processing. 3 Credits. Study of applications of natural language processing techniques and the representations and processes needed to support them. Topics include interfaces, text retrieval, machine translation, speech processing, and text generation. "
  },
  {
    "department": "INLS",
    "number": 513,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Resource Selection and Evaluation. 3 Credits. Identification, provision, and evaluation of resources to meet primary needs of clientele in different institutional environments. "
  },
  {
    "department": "INLS",
    "number": 515,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Consumer Health Information. 3 Credits. Examines concepts of health, health conditions, policy, and information collections and services from social and cultural perspectives. Analysis and design for provision and access to consumer health information services. "
  },
  {
    "department": "INLS",
    "number": 520,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Organization of Information. 3 Credits. Introduction to the problems and methods of organizing information, including information structures, knowledge schemata, data structures, terminological control, index language functions, and implications for searching. "
  },
  {
    "department": "INLS",
    "number": 523,
    "modifier": "",
    "gen eds": "",
    "requirements": "Pre- or corequisite, INLS 161. ",
    "description": "Introduction to Database Concepts and Applications. 3 Credits. Design and implementation of basic database systems. Semantic modeling, relational database theory, including normalization, indexing, and query construction, SQL. "
  },
  {
    "department": "INLS",
    "number": 525,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Electronic Records Management. 3 Credits. Explores relationships between new information and communication technologies and organizational efforts to define, identify, control, manage, and preserve records. Considers the importance of organizational, institutional and technological factors in determining appropriate recordkeeping strategies. "
  },
  {
    "department": "INLS",
    "number": 530,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Young Adult Literature and Related Materials. 3 Credits. A survey of print and nonprint library materials particularly suited to the needs of adolescents. "
  },
  {
    "department": "INLS",
    "number": 534,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Youth and Technology in Libraries. 3 Credits. This course encourages students to explore the array of technologies available to children and adolescents, the issues surrounding the use of technology, the role of care givers, and potential impacts on development. "
  },
  {
    "department": "INLS",
    "number": 539,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Going the Last Mile: Information Access for Underserved Populations. 3 Credits. In this course we investigate the special challenges of providing information services to marginalized populations in an increasingly digital world. "
  },
  {
    "department": "INLS",
    "number": 540,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Building a Personal Digital Library. 3 Credits. Students will implement a personal digital LifeTime Library. Topics include creation of a personal digital library, organization of the material, creation of descriptive metadata, management, and sharing of the collection. "
  },
  {
    "department": "INLS",
    "number": 541,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Information Visualization. 3 Credits. An introduction to information visualization through reading current literature and studying exemplars. The course reviews information visualization techniques, provides a framework for identifying the need for information visualization, and emphasizes interactive electronic visualizations that use freely available tools. Students will construct several visualizations. No programming skills are required. "
  },
  {
    "department": "INLS",
    "number": 550,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "History of the Book and Other Information Formats. 3 Credits. The history of the origin and development of the book in all its formats: clay tablets to electronic. Coverage includes scientific and other scholarly publications, religious works, popular literature, periodicals, and newspapers. "
  },
  {
    "department": "INLS",
    "number": 551,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "History of Libraries and Other Information-Related Cultural Institutions. 3 Credits. The history of cultural institutions related to information from earliest times to the present day. Includes specific institutions, trends in service and facilities, and individuals important in the development of these institutions. "
  },
  {
    "department": "INLS",
    "number": 554,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Cultural Institutions. 3 Credits. This course will explore cultural institutions--libraries, museums, parks, zoological and botanical gardens, reconstructions and other settings--as lifelong educational environments. "
  },
  {
    "department": "INLS",
    "number": 556,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Introduction to Archives and Records Management. 3 Credits. Survey of the principles, techniques, and issues in the acquisition, management, and administration of records, manuscripts, archives, and other cultural and documentary resources in paper, electronic, and other media formats. "
  },
  {
    "department": "INLS",
    "number": 558,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Principles and Techniques of Storytelling. 3 Credits. An overview of storytelling, its historical development, and the presentation and administration of storytelling programs. The class focuses on performance skills merged with theoretical issues. "
  },
  {
    "department": "INLS",
    "number": 560,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Programming for Information Science. 3 Credits. Introduction to programming and computational concepts. Students will learn to write programs using constructs such as iteration, flow control, variables, functions, and error handling. No programming experience required. "
  },
  {
    "department": "INLS",
    "number": 561,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Digital Forensics for Curation of Digital Collections. 3 Credits. Students will learn about hardware, software, principles, and methods for capturing and curating digital data that have been stored on removable media (i.e., hard drives, floppy disks, USB memory sticks). "
  },
  {
    "department": "INLS",
    "number": 566,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, INLS 161 or 461. ",
    "description": "Information Assurance. 3 Credits. Aspects of data integrity, privacy, and security from several perspectives: legal issues, technical tools and methods, social and ethical concerns, and standards. "
  },
  {
    "department": "INLS",
    "number": 572,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, INLS 161. ",
    "description": "Web Development I. 1.5 Credit. Introduction to Internet history, architecture, and applications. Introduces design principles for creating usable and accessible Web sites. Develops technical skills and understanding of standards. "
  },
  {
    "department": "INLS",
    "number": 573,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, INLS 161. ",
    "description": "Mobile Web Development. 1.5 Credit. An introduction to techniques and technologies for the development of mobile Web sites and their applications. "
  },
  {
    "department": "INLS",
    "number": 576,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, INLS 161 or 461. ",
    "description": "Distributed Systems and Administration. 3 Credits. Distributed and client/server-based computing. Includes operating system basics, security concerns, and issues and trends in network administration. "
  },
  {
    "department": "INLS",
    "number": 578,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, INLS 161 or 461. ",
    "description": "Protocols and Network Management. 3 Credits. Network protocols and protocol stacks. Included are discussions of protocol classes, packet filtering, address filtering, network management, and hardware such as protocol analyzers, repeaters, routers, and bridges. "
  },
  {
    "department": "INLS",
    "number": 581,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Research Methods Overview. 3 Credits. An introduction to research methods used in information and library science, exploring the design, interpretation, analysis, and application of published research. "
  },
  {
    "department": "INLS",
    "number": 582,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Systems Analysis. 3 Credits. Introduction to the systems approach to the design and development of information systems. Methods and tools for the analysis and modeling of system functionality (e.g., structured analysis) and data represented in the system (e.g., object-oriented analysis) are studied. Undergraduates are encouraged to take INLS 382 instead of this course. Students may not receive credit for both INLS 582 and INLS 382. "
  },
  {
    "department": "INLS",
    "number": 584,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Information Ethics. 3 Credits. An overview of ethical reasoning, followed by discussion of issues most salient to information professionals, e.g., intellectual property, privacy, access/censorship, effects of computerization, and ethical codes of conduct. "
  },
  {
    "department": "INLS",
    "number": 585,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Management for Information Professionals. 3 Credits. Introduction to management principles and practices for information professionals working in all types of organizations. Topics include planning, budgeting, organizational theory, staffing, leadership, organizational change and evaluation, and decision making. "
  },
  {
    "department": "INLS",
    "number": 586,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Project Management. 1.5 Credit. Strategies and skills needed to effectively manage projects, integrating project management theory with best practices in different organizational perspectives. Individual and team assignments include readings and case studies. "
  },
  {
    "department": "INLS",
    "number": 609,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, INLS 509. ",
    "description": "Experimental Information Retrieval. 3 Credits. This course takes an in-depth look at experimental information retrieval systems that focus on different search tasks and are evaluated in community-wide evaluation forums such as TREC and INEX. "
  },
  {
    "department": "INLS",
    "number": 613,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Text Mining. 3 Credits. This course will allow the student to develop a general understanding of knowledge discovery and gain a specific understanding of text mining. Students will become familiar with both the theoretical and practical aspects of text mining and develop a proficiency with data modeling text. "
  },
  {
    "department": "INLS",
    "number": 620,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisites, INLS 520 or 560. ",
    "description": "Web Information Organization. 3 Credits. Similar programming background needed. Understand the Web as a platform for information organizing systems. Learn how the Web has been designed to be a service platform, data publishing platform, and application platform. "
  },
  {
    "department": "INLS",
    "number": 621,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Personal Information Management. 3 Credits. This course focuses on issues in personal information management research and practice, including information organization, human cognition and memory, task continuity across devices, preservation, and the role of technology in personal information management. "
  },
  {
    "department": "INLS",
    "number": 623,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisites, INLS 382 or 582, and 523. ",
    "description": "Database Systems II: Intermediate Databases. 3 Credits. Intermediate-level design and implementation of database systems, building on topics studied in INLS 523. Additional topics include MySQL, indexing, XML, and nontext databases. "
  },
  {
    "department": "INLS",
    "number": 624,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, INLS 461 or COMP 110 or 116. ",
    "description": "Policy-Based Data Management. 3 Credits. Students will develop policies for managing digital repositories and persistent archives. The rules will be implemented in the integrated Rule-Oriented Data System (iRODS), which organizes and distributes data into shareable collections. "
  },
  {
    "department": "INLS",
    "number": 625,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, INLS 560; permission of the instructor for students lacking the prerequisite. ",
    "description": "Information Analytics. 3 Credits. This course introduces analytical techniques to deal with very large data sets. Students will become familiar with predictive modeling, clustering, data mining, and paradigms such as map resource. "
  },
  {
    "department": "INLS",
    "number": 626,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, INLS 523. ",
    "description": "Introduction to Big Data and NoSQL. 1.5 Credit. Information is being generated at an exponential scale in many areas, from astronomy to social networking and e-marketing. Processes for handling these data are data intensive, require heavy read/write workloads, and do not need the stringent ACID properties of relational databases. Several specific systems will be studied as examples. "
  },
  {
    "department": "INLS",
    "number": 641,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Visual Analytics. 3 Credits. This project-based course provides an overview of visual analytics. Material includes foundational concepts and theories, seminal and recent research in the field, and hands-on experience with commonly used technologies. Programming experience strongly recommended. "
  },
  {
    "department": "INLS",
    "number": 651,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Audio-Visual Archives Management. 1.5 Credit. An introduction to the management of audio, film, and video archives with an emphasis on the history of recording, best practices for preservation and access, and copyright. Through selected readings, lecture, class discussion, assignment, and hands-on demonstration, students will gain an understanding of the history of recording, format identification, storage and handling, philosophy of media preservation, and copyright. "
  },
  {
    "department": "INLS",
    "number": 660,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Social Media and Society: A Theoretical and Empirical Overview. 3 Credits. Explores the evolution, implications, and complications of social media in multiple spheres of life including sociality, community, politics, power and inequality, education, and information from theoretical and empirical perspectives. "
  },
  {
    "department": "INLS",
    "number": 672,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, INLS 572. ",
    "description": "Web Development II. 3 Credits. Study of design and implementation of applications using both client and server side configuration and programming. Example topics include PHP, ruby on Rails, and Javascript. "
  },
  {
    "department": "INLS",
    "number": 690,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Intermediate Selected Topics. 1-3 Credits. Exploration of a special topic not otherwise covered in the curriculum, at an intermediate level. Previous offering of this course does not predict future availability; new courses may replace these. Topic varies by instructor. Repeat rules: May be repeated for credit; may be repeated in the same term for different topics; 9 total credits. 3 total completions. "
  },
  {
    "department": "INLS",
    "number": 691,
    "modifier": "H",
    "gen eds": "CI, EE-Mentored Research. ",
    "requirements": "",
    "description": " Research Methods in Information Science. 3 Credits. Senior standing and permission of the instructor. Restricted to information science majors. An introduction to research methods used in information science. Includes the writing of a research proposal. "
  },
  {
    "department": "INLS",
    "number": 692,
    "modifier": "H",
    "gen eds": "EE-Mentored Research. ",
    "requirements": "",
    "description": " Honors Thesis in Information Science. 3 Credits. Senior standing and permission of the instructor. Restricted to information science majors Students in the SILS undergraduate honors program engage in independent research and write an honors thesis reporting the research under the supervision of a faculty member. "
  },
  {
    "department": "INLS",
    "number": 696,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, permission of the instructor. ",
    "description": "Study in Information and Library Science. 1-3 Credits. Study by an individual student on a special topic under the direction of a specific faculty member. Six credit maximum for master's students. Graduate faculty. Repeat rules: May be repeated for credit; may be repeated in the same term for different topics; 6 total credits. 2 total completions. "
  },
  {
    "department": "INLS",
    "number": 697,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Information Science Capstone. 3 Credits. Senior standing required. Information science major or minor. Contemporary topics of information science, information systems, information technology, information design, and information management. Assessment of future impact of new developments. "
  },
  {
    "department": "NURS",
    "number": 253,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Individual Development across the Lifespan. 2 Credits. Majors only. This course emphasizes a lifespan approach to theories and perspectives on individual growth and development. Content focuses on physical, cognitive, and socioemotional development, and risk factors from birth to death. "
  },
  {
    "department": "NURS",
    "number": 254,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Discipline of Nursing I. 1 Credit. Majors only. This course introduces the discipline, profession, and practice of nursing through a study of history, values, culture, legal issues, and education. Critical thinking central to nursing practice is introduced. "
  },
  {
    "department": "NURS",
    "number": 261,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Nursing Role in Normal Nutrition. 2 Credits. Majors only. This course involves the nursing application of nutritional concepts to the care of individuals, families, groups, and populations across the life span. "
  },
  {
    "department": "NURS",
    "number": 360,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Concepts, Processes, and Skills for Evidence-Based Nursing. 4 Credits. Majors only. The course introduces fundamentals of nursing practice and integrates the nursing process with emphasis on the application of evidenced-based practice. The role of the nurse as a member of the healthcare team is emphasized. The lab setting provides practical application of principles and skills required for clinical practice. "
  },
  {
    "department": "NURS",
    "number": 361,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Pathophysiology. 3 Credits. Majors only. This course is concerned with alterations involved in disruptions of normal physiology as well as pathophysiological principles underlying therapeutic interventions and outcomes. "
  },
  {
    "department": "NURS",
    "number": 362,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Pharmacology across the Lifespan. 3 Credits. Majors only. Using the science of pharmacology and pharmacologic principles underlying therapeutic interventions, this course focuses on an introduction to nursing responsibilities regarding pharmacologic therapy across the lifespan. "
  },
  {
    "department": "NURS",
    "number": 364,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisites, NURS 253, 261, 361, and 366. Corequisites, NURS 360 and 362. ",
    "description": "Nursing Care of Adults with Major Health Problems, I. 6 Credits. Majors only. This is the first of two adult health courses in which students apply critical thinking skills to nursing care of adults with major health problems. "
  },
  {
    "department": "NURS",
    "number": 366,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Health Assessment. 3 Credits. Majors only. This course addresses concepts and methods of comprehensive health assessment of children, adults, and elders. Emphasis will be on data collection as a basis for initiation of caring and decision making in nursing practice. "
  },
  {
    "department": "NURS",
    "number": 369,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Physical Assessment. 3 Credits. Admission to the RN-BSN option or permission of the instructor. This course expands the student's previous knowledge base of the skills and principles of historical, psychological, and physical assessment and identifies these data as the basis for nursing care. "
  },
  {
    "department": "NURS",
    "number": 371,
    "modifier": "",
    "gen eds": "",
    "requirements": "co-requisite, NURS 364; ",
    "description": "Nursing Inquiry and Evidence-Based Practice. 3 Credits. Pre- or permission of the instructor for students lacking the prerequisite. Students are introduced to key concepts of evidence-based nursing practice, including the research process, protection of human subjects, and retrieval and appraisal of evidence to maintain a scientifically sound practice. "
  },
  {
    "department": "NURS",
    "number": 377,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Research in Nursing Practice. 3 Credits. Majors only. This course introduces components of the research process with application to the theory and practice of nursing. The course provides the foundation for master's-level nursing research course. "
  },
  {
    "department": "NURS",
    "number": 379,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Leadership in Nursing Practice. 3 Credits. Majors only. Students will examine health care organizations from a systems perspective and develop leadership skills necessary in professional practice. "
  },
  {
    "department": "NURS",
    "number": 382,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Family-Centered Genomic Health Care. 1 Credit. Majors only. This course explores essential competencies in genetics and genomics for registered nurses. The learner gains knowledge about family assessment and the impact of genomic issues on individuals and families. "
  },
  {
    "department": "NURS",
    "number": 456,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisites, NURS 254 and at least one of the following: NURS 470, 472, 477, or 479. ",
    "description": "Discipline of Nursing II. 2 Credits. Majors only. This course emphasizes professional development through exploration of a variety of roles and practice environments. Students analyze personal and professional goals and values to develop a framework for nursing practice. Repeat rules: May be repeated for credit. 2 total credits. 1 total completions. "
  },
  {
    "department": "NURS",
    "number": 470,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisites, NURS 364 and 371. Co-requisites, NURS 472, 477, or 479. ",
    "description": "Public Health Nursing. 5 Credits. Majors only. Students apply public health concepts to community practice to improve health and reduce disparities across the lifespan, emphasizing interventions using partnership strategies at individual/family, organizational, and policy levels. "
  },
  {
    "department": "NURS",
    "number": 472,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, NURS 364. ",
    "description": "Nursing Care of Infants, Children, and Their Families. 5 Credits. Majors only. Nursing care of infants, children, and their families is explored. Knowledge from a variety of disciplines is applied through the nursing process to the direct care of infants and children. "
  },
  {
    "department": "NURS",
    "number": 477,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisites, NURS 253, 361, and 362. Corequisites, NURS 364 and 382. ",
    "description": "Psychiatric Mental Health Concepts for Broad Clinical Application in Nursing. 5 Credits. Majors only. Using theories of psychosocial development, psychopathology, therapeutic communication, and psychotherapy, this course requires students to examine the range and complexities of human emotional suffering and methods of effective intervention. "
  },
  {
    "department": "NURS",
    "number": 479,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, NURS 364. ",
    "description": "Maternal/Newborn Nursing. 5 Credits. Majors only. The course focuses on application of caring and critical thinking skills in providing evidence-based nursing care to childbearing families. "
  },
  {
    "department": "NURS",
    "number": 487,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisites, NURS 254 and 364. ",
    "description": "Practicum in Nursing: Work-Study Experience. 3 Credits. Certification as Nurse Aide I and II also required as pre- or corequisite. Majors only. This course provides the student an opportunity to participate in a work-study experience in participating health care agencies. Students participate in a reflective experience that integrates classroom and experiential learning. "
  },
  {
    "department": "NURS",
    "number": 488,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisites, NURS 254 and 364. ",
    "description": "Practicum in Nursing: Health Services Improvement Work Experience. 3 Credits. Majors only. Certification as a Nurse Aide I and Nurse Aide II are recommended. Practice in health care settings is the course focus. Students participate in a reflective experience that provides the context to integrate classroom and experiential learning into an evolving professional identity. "
  },
  {
    "department": "NURS",
    "number": 489,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisites, NURS 254, 364, and two of the following: NURS 470, 472, 477, 479, 591. ",
    "description": "Practicum in Nursing: Global Health Experience. 3 Credits. Majors only. Certifications as a Nurse Aide I and Nurse Aide II are recommended. Practice in global health care settings is the course focus. Students participate in a reflective experience that provides the context to integrate classroom and experiential learning into an evolving professional identity. "
  },
  {
    "department": "NURS",
    "number": 491,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Improving Nursing Practice: Application of Concepts, Theories, and Research. 3 Credits. Majors only. This course emphasizes analysis of clinical problems that affect the nursing care of selected populations. Students also apply the nursing process, therapeutic communication skills, and teaching-learning principles in clinical situations. "
  },
  {
    "department": "NURS",
    "number": 492,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Conceptual Bases of Professional Nursing Practice. 3 Credits. Majors only. Selected concepts, theories, and models are synthesized, appraised, and applied as a basis for making judgments and decisions in nursing practice. "
  },
  {
    "department": "NURS",
    "number": 494,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Community Health Nursing for the Public's Health. 3-6 Credits. Majors only. Prepares R.N. students for population-focused practice in community health nursing. Analyses and applications of selected theories; health promotion/protection and disease prevention strategies are emphasized. "
  },
  {
    "department": "NURS",
    "number": 496,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Advanced Practicum in Nursing. 1-3 Credits. Majors only. The focus of this course is the development of knowledge and experience related to research or service learning and its application to the practice of nursing and health care. Repeat rules: May be repeated for credit.  "
  },
  {
    "department": "NURS",
    "number": 497,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Preparation for Professional Practice. 1 Credit. Seniors only or permission of the instructor. This course will assist students in preparation for the NCLEX-RN examination through a strategic and systematic individualized plan of study that utilizes the ATI program and other relevant resources. Limited enrollment. Repeat rules: May be repeated for credit. 3 total credits. 3 total completions. "
  },
  {
    "department": "NURS",
    "number": 585,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Alternative Paradigms for Nursing Practice. 3 Credits. Majors only. Concepts and principles underlying biomedical and biopsychosocial approaches to health care delivery are analyzed to determine their impact on health and to provide a framework for integrating both approaches to care. "
  },
  {
    "department": "NURS",
    "number": 586,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Contemporary Issues in Nursing Practice. 3 Credits. Majors only. The context of professional nursing practice will be analyzed from a social, economic, and policy perspective. Analysis will include projections for the future of the profession. "
  },
  {
    "department": "NURS",
    "number": 588,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisites, NURS 364, 371, and 487 or 489, and 472 or 477 or 479. Corequisite, NURS 488. ",
    "description": "Leadership in Health Care Organizations. 4 Credits. Majors only. This course explores organizational leadership and management practices and theories. Current social, economic, legal, ethical, and policy issues affecting practice, education, and the profession of nursing are examined. "
  },
  {
    "department": "NURS",
    "number": 591,
    "modifier": "",
    "gen eds": "EE-Field Work. ",
    "requirements": "Prerequisites, NURS 364 and 371; co-requisite, NURS 456. ",
    "description": "Nursing Care of Adults with Major Health Problems, II. 8 Credits. Majors only. This senior-level course focuses on applying critical thinking, clinical decision making, and evidence-based nursing practice to complex health problems of adults. Unique health needs of older adults are addressed. "
  },
  {
    "department": "NURS",
    "number": 600,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "SHAC: Student Health Action Coalition. 0 Credits. This course provides service-learning opportunities to apply nursing practice within the context of interprofessional care for vulnerable populations by participating with Student Health Action Coalition (SHAC) activities. Repeat rules: May be repeated for credit. 0 total credits. 8 total completions. "
  },
  {
    "department": "NURS",
    "number": 609,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Health Care in the Global Context. 1 Credit. Majors only or permission of the instructor. A faculty-led experiential learning opportunity focusing on development and knowledge related to research, health care systems, or service learning and its application to nursing and health care. Repeat rules: May be repeated for credit.  "
  },
  {
    "department": "NURS",
    "number": 611,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Supporting the Childbearing Family. 2 Credits. Application required. An interprofessional, service-learning approach to studying maternity care. Students will receive professional doula training and volunteer as birth doulas within the Volunteer Doula Service Program at North Carolina Women's Hospital. "
  },
  {
    "department": "NURS",
    "number": 642,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Health Promotion and Illness Prevention in Advanced Nursing Practice. 2 Credits. NURS 647. Contemporary Issues in the Role of Advanced Practice Nursing. 3 Credits. Graduate students only. This course examines the evolution, current issues, and roles in advanced practice nursing within the context of contemporary healthcare delivery. "
  },
  {
    "department": "NURS",
    "number": 671,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Nursing Inquiry and Evidence-Based Practice for Advanced Scholarship. 3 Credits. Students anticipating graduate study are introduced to scientific inquiry and principles of evidence-based practice, including theoretical perspectives related to inquiry; ethics; identification of research problems, development of research questions, and appropriate design; data interpretation with emphasis on statistical analysis; and rigorous appraisal of research reports. "
  },
  {
    "department": "NURS",
    "number": 675,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Hillman Scholars in Nursing Innovation: Integrative Seminar. 1 Credit. Admission to the Hillman Scholars Program in Nursing Innovation is required. This seminar will cultivate personal and professional skills essential for students' development and socialization as nurse innovators, leaders, researchers, and scholars. Content is iterative and progressive in depth and scope. Repeat rules: May be repeated for credit.  "
  },
  {
    "department": "NURS",
    "number": 680,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Experimental Courses. 1-3 Credits. Pilot test for new courses in the nursing program. Repeat rules: May be repeated for credit; may be repeated in the same term for different topics; 12 total credits. 4 total completions. "
  },
  {
    "department": "NURS",
    "number": 685,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Care of the Dying and Bereaved throughout the Life Span. 3 Credits. Students from a variety of health sciences-related disciplines gain an understanding of issues in working with dying and bereaved individuals of all ages and their families. "
  },
  {
    "department": "NURS",
    "number": 687,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Ethical Issues in Nursing. 2 Credits. Examination and discussion of major ethical issues arising in the professional practice of nursing in the context of systematic consideration of the nature of ethical choice. "
  },
  {
    "department": "NURS",
    "number": 691,
    "modifier": "H",
    "gen eds": "EE-Mentored Research. ",
    "requirements": "",
    "description": " Honors in Nursing, Part I. 3 Credits. Permission of the program director. Majors only. Preparation of a two-semester honors project under the direction of department advisors. "
  },
  {
    "department": "NURS",
    "number": 692,
    "modifier": "H",
    "gen eds": "EE-Mentored Research. ",
    "requirements": "",
    "description": " Honors in Nursing, Part II. 3 Credits. Permission of the program director. Majors only. Preparation of a two-semester honors project under the direction of department advisors. "
  },
  {
    "department": "PHCY",
    "number": 124,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, ENGL 105. ",
    "description": "Contemporary Communications in Health Care. 1 Credit. This course exposes students to approaches and strategies that optimize communication in today's dynamic health care field. It is ideal for those considering a career in the health sciences. Students will engage in multifaceted activities and discussions with experienced practitioners and apply course concepts to real world scenarios. "
  },
  {
    "department": "HBEH",
    "number": 396,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Independent Study in Health Behavior. 1-6 Credits. Advanced course for undergraduates who wish to pursue a topic or research study in health behavior. To be arranged with faculty. An approved work plan is required. Repeat rules: May be repeated for credit. 6 total credits. 6 total completions. "
  },
  {
    "department": "HBEH",
    "number": 561,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Environmental and Science Video Storytelling. 3 Credits. Students work in teams to produce, shoot, script, and report environmental, science, and medical stories for broadcast on \"Carolina Week\", the award-winning, student-produced television newscast. "
  },
  {
    "department": "HBEH",
    "number": 562,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Environmental and Science Documentary Television. 3 Credits. Students work in teams to conceive, produce, and script mini-documenties on environmental and science topics for broadcast on North Carolina Public Television. "
  },
  {
    "department": "HBEH",
    "number": 600,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Social and Behavioral Sciences in Public Health. 3 Credits. This course focuses on social and behavioral science theories, research and interventions aimed at promoting health of individuals, groups, communities and populations. Two lecture hours per week. Enrollment is restricted to junior, senior, graduate, and certificate students in programs or majors within the School of Public Health. "
  },
  {
    "department": "HBEH",
    "number": 601,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Principles of Statistical Inference for Health Behavior. 3 Credits. Required preparation, knowledge of basic descriptive statistics. Majors only. Major topics include elementary probability theory, probability distributions, estimation, tests of hypotheses, paired and independent samples t-tests, ANOVA, linear and logistic regression, correlation and chi-squared procedures. SAS, a statistical software package, is used in the course. "
  },
  {
    "department": "HBEH",
    "number": 610,
    "modifier": "",
    "gen eds": "EE-Service Learning. ",
    "requirements": "",
    "description": "Alternative Spring Break. 2 Credits. This course will explore issues, theories, and experiences relevant to social action, coalition building, and social change. The content of this course will be examined by confronting the possibilities and limitations of service and service-learning as it relates to APPLES Alternative Spring Break experiences. "
  },
  {
    "department": "HBEH",
    "number": 611,
    "modifier": "",
    "gen eds": "EE-Service Learning. ",
    "requirements": "",
    "description": "Philanthropy as a Tool for Social Change. 3 Credits. In this course students learn about and experience the process of awarding grants to local agencies. In addition to participating in the grant-making process, students learn about the nonprofit sector and the philosophy and practice of philanthropy through readings, class exercises, and guest speakers. "
  },
  {
    "department": "HBEH",
    "number": 625,
    "modifier": "",
    "gen eds": "",
    "requirements": "Pre- or corequisite, EPID 600. ",
    "description": "Injury as a Public Health Problem. 1 Credit. This course considers the causes and consequences of traumatic injury and dilemmas in injury research and prevention. This one-credit course consists of 10 class sessions of 75 minutes each over the first five weeks of the semester. "
  },
  {
    "department": "HBEH",
    "number": 626,
    "modifier": "",
    "gen eds": "",
    "requirements": "Corequisite, EPID 625. ",
    "description": "Intentional Injury as a Public Health Problem. 1 Credit. This one-credit course considers the causes and consequences of intentional injury and dilemmas in injury research and prevention. The course meets once a week for 75 minutes starting the sixth week of the semester. Students may enroll concurrently in EPID 627. "
  },
  {
    "department": "HBEH",
    "number": 627,
    "modifier": "",
    "gen eds": "",
    "requirements": "Corequisite, EPID 625. ",
    "description": "Unintentional Injury as a Public Health Problem. 1 Credit. This one-credit course considers the causes and consequences of unintentional injury and dilemmas in injury research and prevention. The course meets once a week for 75 minutes starting the sixth week of the semester. "
  },
  {
    "department": "HBEH",
    "number": 660,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Environmental and Science Journalism. 3 Credits. Prepare students to work as environmental and science journalists. The course emphasizes writing skills in all delivery formats and interpreting environmental, science, and medical information for consumers. "
  },
  {
    "department": "HBEH",
    "number": 690,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Special Topics in Health Behavior. 1-3 Credits. Special topics in health behavior. An experimental course designed for faculty who wish to offer a new course. Content will vary from semester to semester. Repeat rules: May be repeated for credit. 6 total credits. 6 total completions. "
  },
  {
    "department": "PUBH",
    "number": 89,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "irst-Year Seminar: Special Topics. 3 Credits. Content varies by semester. Repeat rules: May be repeated for credit; may be repeated in the same term for different topics; 6 total credits. 2 total completions. "
  },
  {
    "department": "PUBH",
    "number": 420,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "The AIDS Course. 1 Credit. This course offers participants a multidisciplinary perspective on HIV/AIDS -- its etiology, immunology, epidemiology, and impact on individuals and society. How HIV/AIDS is framed by a society determines not only how affected persons are treated but also the degree to which the rights of the individual are upheld. "
  },
  {
    "department": "PUBH",
    "number": 423,
    "modifier": "",
    "gen eds": "EE-Service Learning. ",
    "requirements": "",
    "description": "AIDS Service. 3 Credits. This course will integrate community service into the campus-wide AIDS course. Students will work as volunteer interns three to five hours per week for 10 weeks during the semester with Triangle-area community service organizations. "
  },
  {
    "department": "PUBH",
    "number": 450,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Data Skills Online. 1 Credit. This online, asynchronous class presents a series of discrete tools designed to teach skills to health professionals for using technology and data management/analysis. Online course. "
  },
  {
    "department": "PUBH",
    "number": 496,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Readings in Public Health Practice. 1-3 Credits. Permission of the instructor. Intensive study of a special problem in public health practice. Repeat rules: May be repeated for credit; may be repeated in the same term for different topics; 12 total credits. 4 total completions. "
  },
  {
    "department": "PUBH",
    "number": 500,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Global Health Discussion Series. 0.5 Credits. Provides opportunities for students to get to know each other through an exchange and discussion. Students exchange points of view with globally experienced faculty at UNC-Chapel Hill. "
  },
  {
    "department": "PUBH",
    "number": 510,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Interdisciplinary Perspectives in Global Health. 3 Credits. Explores issues, problems, and controversies in global health through an interdisciplinary perspective; examines the complex tapestry of social, economic, political, and environmental factors that affect global health; analyzes global health disparities through a social justice and human rights lens; and exposes students to opportunities in global health work and research. Repeat rules: May be repeated for credit.  "
  },
  {
    "department": "PUBH",
    "number": 610,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Introductory Spanish for Health Professionals. 3 Credits. This course is intended for students who know no Spanish or so little that they feel the need to start over. Students with more than two semesters of college Spanish are not eligible. The course covers the curriculum of first-semester Spanish taught within a health context, with a focus on speaking. "
  },
  {
    "department": "PUBH",
    "number": 613,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Intermediate Spanish for Health Care I. 3 Credits. This intermediate course is the equivalent of the third semester of college Spanish. Students will hone their listening and speaking skills in class primarily through role-playing activities and class discussion. Activities center on an original film set in a health clinic in rural North Carolina. "
  },
  {
    "department": "PUBH",
    "number": 615,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Advanced Spanish for Health Care I. 3 Credits. Required preparation, third semester Spanish or equivalent. This advanced course reviews the grammar of the third and fourth semester of college Spanish. Students hone their listening and speaking skills through role-playing activities and class discussion. Activities center on an original film set in a Latino-run health clinic. "
  },
  {
    "department": "PUBH",
    "number": 670,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Clinical Research Methods. 3 Credits. This course explores contemporary issues, problems, and controversies in global health through an interdisciplinary perspective. It examines the tapestry of social, economic, political, and environmental factors that affect global health. "
  },
  {
    "department": "PUBH",
    "number": 671,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Writing Scientific Research. 3 Credits. This course, Introduction to Clinical Research, is designed to give the undergraduate student an overview of clinical research methods. During the semester we will carry actual research projects. "
  },
  {
    "department": "PUBH",
    "number": 680,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Public Health Practice. 3 Credits. A comprehensive introduction to public health concepts and practice through an examination of the philosophy, purpose, history, organization, functions, tools, activities, and results of public health practice at the national, state, and community levels. Online course. "
  },
  {
    "department": "PUBH",
    "number": 690,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Special Topics in Public Health Leadership. 1-3 Credits. Permission of the instructor. Sections will focus on specific topics of current interest to health workers. Fliers describing the section offering will be distributed prior to registration each semester. Lecture hours per week dependent upon credit. Repeat rules: May be repeated for credit; may be repeated in the same term for different topics; 12 total credits. 4 total completions. "
  },
  {
    "department": "PUBH",
    "number": 696,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Independent Study. 1-3 Credits. Independent Study to address goals and objects of student. Prior faculty agreement is required. Registration for an independent study course must be completed after the learning contract has been approved and no later than the last day of \"late registration\" (the end of the first week of classes in F/S). "
  },
  {
    "department": "SPHG",
    "number": 350,
    "modifier": "H",
    "gen eds": "",
    "requirements": "",
    "description": " Introduction to Public Health. 3 Credits. This introductory course will describe the history of public health, the key terms and concepts, and how the core areas of public health are integrated to promote health at a population level. The class will engage the students in active learning through the use of media, innovative technology, discussion groups, and field experiences. "
  },
  {
    "department": "SPHG",
    "number": 600,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Introduction to Public Health. 3 Credits. School of Public Health majors only. This introductory course describes the history of public health, key terms, concepts, and the integration of core areas of public health to promote health at a population level. The class engages students in active learning through the use of media, innovative technology, discussion groups, and field experiences. "
  },
  {
    "department": "SPHG",
    "number": 620,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Exploring Public Health. 1 Credit. This introductory course serves to develop a foundation in the breadth and depth of public health, locally and globally. Students will develop an understanding of the basic concepts of the public health disciplines and how they are used to promote health at a population level. "
  },
  {
    "department": "SPHG",
    "number": 690,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Special Topics in Public Health. 1-3 Credits. Topic will vary with the instructor and semester. Repeat rules: May be repeated for credit; may be repeated in the same term for different topics; 9 total credits. 3 total completions. "
  },
  {
    "department": "MEJO",
    "number": 89,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "irst-Year Seminar: Special Topics. 3 Credits.  Special topics course. Contents will vary each semester. Repeat rules: May be repeated for credit; may be repeated in the same term for different topics; 6 total credits. 2 total completions. "
  },
  {
    "department": "MEJO",
    "number": 100,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Grammar for Journalists. 1 Credit.  The goal of this course is to teach students basic skills in grammar, punctuation, and spelling and help prepare them for the school's spelling and grammar exam. Students must earn a score of 70 or above on the exam to receive their degree. "
  },
  {
    "department": "MEJO",
    "number": 101,
    "modifier": "",
    "gen eds": "SS. ",
    "requirements": "",
    "description": "The Media Revolution: From Gutenberg to Zuckerberg and Beyond. 3 Credits.  An introduction to the various facets of communication from the objective world of news media to the persuasive worlds of advertising, public relations, and social media. Developing skills and strengthening knowledge concerning media and communication industries, their content, and their effects on society as well as on individuals. "
  },
  {
    "department": "MEJO",
    "number": 102,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Future Vision: Exploring the Visual World. 3 Credits.  Survey of visual communication tools, techniques, and theories, and how they may be used in all areas of the mass media, present and future. Not open to students who have already taken MEJO 180, 182, or 187. "
  },
  {
    "department": "MEJO",
    "number": 121,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Introduction to Digital Storytelling. 3 Credits.  Restricted to declared journalism majors and minors. Introduces students to the tools and skills needed to engage in quality news-oriented storytelling with audio, video, and multimedia. Students will learn to deliver news stories using multiple platforms, taking advantage of the strengths of each. Previously offered as MEJO 221. "
  },
  {
    "department": "MEJO",
    "number": 129,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Sports Xtra. 3 Credits.  In this course students will produce a weekly sports highlights, analysis, and commentary program for distribution via cable television. Students fill all editorial, field production, and studio production positions. Previously offered as MEJO 429. "
  },
  {
    "department": "MEJO",
    "number": 137,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Principles of Advertising and Public Relations. 3 Credits.  Survey of the economics, philosophy, and history of both fields with emphasis on research, foundations, design, execution, and assessment of strategic communication efforts. Provides an understanding of both disciplines, including historical developments, issues and controversies, best practices, career opportunities, and components of successful advertising and public relations campaigns. "
  },
  {
    "department": "MEJO",
    "number": 141,
    "modifier": "",
    "gen eds": "PH. ",
    "requirements": "",
    "description": "Media Ethics. 3 Credits.  Explore what constitutes ethical practices, what interferes with ethical practices, and what emerging ethical issues may challenge the newest generation of professional communicators. Cases involve print, broadcast, and Internet news media; photojournalism; graphic design; public relations; and advertising. "
  },
  {
    "department": "MEJO",
    "number": 153,
    "modifier": "",
    "gen eds": "CI. ",
    "requirements": "",
    "description": "Writing and Reporting. 3 Credits.  A laboratory course that teaches journalistic skills essential to writing across platforms. Practice in using news gathering tools, such as sourcing and interviewing techniques; writing stories, including leads, organization, quotations, and data; editing for grammar, punctuation, brevity, style, and accuracy; and critical thinking about news values and audiences. "
  },
  {
    "department": "MEJO",
    "number": 157,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, MEJO 153. ",
    "description": "News Editing. 3 Credits.  Study and practice in copyediting, headline writing, and caption writing for print, digital, and social media. "
  },
  {
    "department": "MEJO",
    "number": 180,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Foundations of Photojournalism. 3 Credits.  An introductory course in photojournalistic technique and content gathering. Students photograph, edit, and publish assignments, including general news events, sports, feature and portrait assignments, and a picture story. "
  },
  {
    "department": "MEJO",
    "number": 182,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Foundations of Graphic Design. 3 Credits.  Principles and practices of design, typography, graphics, and production for visual communication for print and electronic media. Computer graphics and pagination. "
  },
  {
    "department": "MEJO",
    "number": 187,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Foundations of Interactive Media. 3 Credits.  Entry-level course in multimedia storytelling that includes modules on theory; the profession; design; content gathering; and editing, programming, publishing, and usability. "
  },
  {
    "department": "MEJO",
    "number": 240,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Current Issues in Mass Communication. 3 Credits.  Analysis of the interrelationships between United States mass media and the society that they serve. "
  },
  {
    "department": "MEJO",
    "number": 242,
    "modifier": "",
    "gen eds": "HS. ",
    "requirements": "",
    "description": "From Gutenberg to Google: A History of Media. 3 Credits.  A historical examination of the changing role of the media professional and forms of media and communication as they have developed in relation to particular social, political, economic, and technological conditions. "
  },
  {
    "department": "MEJO",
    "number": 244,
    "modifier": "",
    "gen eds": "SS. ",
    "requirements": "Prerequisite, MEJO 153. ",
    "description": "Talk Politics: An Introduction to Political Communication. 3 Credits.  An overview of political communication issues and an examination of political campaigns for students who intend to practice communication in the public arena and for those interested in political processes. "
  },
  {
    "department": "MEJO",
    "number": 245,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Sports and the Media. 1 Credit.  A comprehensive overview of the relationship between sports and the media. Athletes, coaches, and professionals share what goes into producing the sports journalism that we read, listen to, and watch. "
  },
  {
    "department": "MEJO",
    "number": 252,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Audio Journalism. 3 Credits.  Students learn how to conceive, research, report, and produce audio stories for broadcast on radio and/or streaming on the Web. Students also learn interviewing and reporting techniques that will prepare them for higher-level courses. "
  },
  {
    "department": "MEJO",
    "number": 253,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, MEJO 153. ",
    "description": "Introduction to Public Affairs Reporting. 3 Credits.  Exercises in news gathering, interviewing, and writing news regardless of the delivery platform. "
  },
  {
    "department": "MEJO",
    "number": 332,
    "modifier": "",
    "gen eds": "EE-Service Learning. ",
    "requirements": "Prerequisites, MEJO 137 and 153. ",
    "description": "Public Relations Writing. 3 Credits.  Service-learning course provides hands-on practice in developing multiplatform communication tools (print, digital, and social media) used by public relations practitioners. Previously offered as MEJO 232. "
  },
  {
    "department": "MEJO",
    "number": 333,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, MEJO 137. ",
    "description": "Video Communication for Public Relations and Marketing. 3 Credits.  Introduction to the use of video as a means of communicating with a variety of an organization's publics, both internal and external. Significant emphasis on building professional skills including teamwork, project management, client management, and creative problem solving. "
  },
  {
    "department": "MEJO",
    "number": 334,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Presentation Design for Strategic Communication. 3 Credits.  Students learn basic principles of graphic design vocabulary and work with related software. By the end of the course, students should be able to accomplish basic design tasks, understand how software applications work together, and be able to use software as a comfortable part of the creative design process. "
  },
  {
    "department": "MEJO",
    "number": 340,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, MEJO 153. ",
    "description": "Introduction to Media Law: Journalism Focus. 3 Credits.  Focuses on speech and press freedoms under the First Amendment. Topics include prior restraint, libel, privacy, protection of anonymous sources, free press-fair trial, federal regulation of electronic and new media, freedom of information, intellectual property, and international issues. "
  },
  {
    "department": "MEJO",
    "number": 341,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, MEJO 153. ",
    "description": "Introduction to Media Law: Advertising, Public Relations, and Strategic Communication Focus. 3 Credits.  Focuses on speech and related freedoms under the First Amendment. Topics include commercial speech, corporate speech, libel, privacy, regulated commercial communications, federal regulation of electronic and new media, freedom of information, intellectual property, and international issues. "
  },
  {
    "department": "MEJO",
    "number": 342,
    "modifier": "",
    "gen eds": "HS, US. ",
    "requirements": "",
    "description": "The Black Press and United States History. 3 Credits.  A chronological survey of the African American press in the United States since 1827. Emphasis is on key people and issues during critical areas in the African American experience. "
  },
  {
    "department": "MEJO",
    "number": 349,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Introduction to Internet Issues and Concepts. 3 Credits.  Students develop an understanding of social, legal, political, and other issues related to the use of the Internet. Offered online. "
  },
  {
    "department": "MEJO",
    "number": 356,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, MEJO 153. ",
    "description": "Feature Writing. 3 Credits.  Instruction and practice in writing feature articles for newspapers and magazines. Previously offered as MEJO 256. "
  },
  {
    "department": "MEJO",
    "number": 358,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, MEJO 153. ",
    "description": "Opinion Writing. 3 Credits.  Practice in writing commentary for all forms of mass communication, from journalism to public relations, no matter the delivery format. Previously offered as MEJO 258. "
  },
  {
    "department": "MEJO",
    "number": 371,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, MEJO 137. ",
    "description": "Advertising Creative. 3 Credits.  Application of findings from social science research; social responsibility of the copywriter and advertiser; preparation of advertisements for the mass media; research in copy testing. Previously offered as MEJO 271. "
  },
  {
    "department": "MEJO",
    "number": 372,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, MEJO 137. ",
    "description": "Advertising Media. 3 Credits.  The media-planning function in advertising for both buyers and sellers of media; the relationships among media, messages, and audiences; computer analysis. Previously offered as MEJO 272. "
  },
  {
    "department": "MEJO",
    "number": 376,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Sports Marketing and Advertising. 3 Credits.  Examines the range of promotional techniques being used in the modern sports industry. Topics include sponsorships, advertising, merchandising, and the effects of commercialization. "
  },
  {
    "department": "MEJO",
    "number": 377,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Sports Communication. 3 Credits.  Permission of the instructor. Examination of organizations involved in the sports communication field, including publishing, team and league media relations, college sports information offices, broadcasting, and advertising. "
  },
  {
    "department": "MEJO",
    "number": 379,
    "modifier": "",
    "gen eds": "QI. ",
    "requirements": "Prerequisite, MEJO 137. ",
    "description": "Advertising and Public Relations Research. 3 Credits.  Critical understanding and application of quantitative and qualitative methods used in the strategic planning and evaluation of advertising and public relations campaigns. Course previously offered as MEJO 279. "
  },
  {
    "department": "MEJO",
    "number": 390,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Special Skills in Mass Communication. 1-3 Credits.  Courses on various skills in journalism-mass communication with subjects and instructors varying each semester. This course satisfies a skills- or craft-course requirement. Descriptions for each section available on the school's Web site under Course Details. Repeat rules: May be repeated for credit; may be repeated in the same term for different topics; 9 total credits. 3 total completions. "
  },
  {
    "department": "MEJO",
    "number": 393,
    "modifier": "",
    "gen eds": "EE-Academic Internship. ",
    "requirements": "Prerequisite, MEJO 153; permission of the instructor for students lacking the prerequisite. ",
    "description": "Mass Communication Practicum. 1 Credit.  Restricted to declared journalism majors and minors. Students work with area media and advertising and public relations firms and meet weekly for consultation and evaluation by the faculty advisor. Must be taken Pass/Fail only. Repeat rules: May be repeated for credit. 3 total credits. 3 total completions. "
  },
  {
    "department": "MEJO",
    "number": 421,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisites, MEJO 121 and 252. ",
    "description": "Television News Reporting and Producing. 3 Credits.  Permission of the instructor. This course covers writing, reporting, and producing television news stories and programs, with emphasis on basic as well as innovative broadcast story forms. "
  },
  {
    "department": "MEJO",
    "number": 424,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Media Management and Policy. 3 Credits.  An introduction to media management, generally, and the supervision and motivation of employees, specifically. The course also delves into policy and legal issues impacting modern media operations. It explores the special skills associated with management of media properties in the context of constant change. "
  },
  {
    "department": "MEJO",
    "number": 425,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Voice and Diction. 3 Credits.  Designed to help students develop presentation skills and use voices effectively as professional broadcast journalists. "
  },
  {
    "department": "MEJO",
    "number": 426,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, MEJO 252. ",
    "description": "Producing Radio. 3 Credits.  Students work under faculty guidance to produce \"Carolina Connection,\" a weekly 30-minute radio news program, and are responsible for all production tasks: producing, reporting, anchoring, and editing. "
  },
  {
    "department": "MEJO",
    "number": 435,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, MEJO 137. ",
    "description": "Public Information Strategies. 3 Credits.  This course provides a comprehensive assessment and understanding of the role of public relations professionals throughout government and the nonprofit sector as well. The course examines the unique requirements placed on communicators who are simultaneously responsible for representing their respective organizations while keeping the public informed. "
  },
  {
    "department": "MEJO",
    "number": 440,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, MEJO 340. ",
    "description": "Digital Media Law and Society. 3 Credits.  Explains legal issues raised by Internet communication and guides students in thinking critically about how those issues can be resolved. Reviews how courts, other branches of government, the private sector, and legal scholars have responded to the Internet. Topics may include digital copyright, net neutrality, privacy, and Internet censorship abroad. "
  },
  {
    "department": "MEJO",
    "number": 441,
    "modifier": "",
    "gen eds": "US. ",
    "requirements": "",
    "description": "Diversity and Communication. 3 Credits.  An examination of racial stereotypes and minority portrayals in United States culture and communication. Emphasis is on the portrayal of Native Americans, African Americans, Hispanics, and Asian Americans in the mass media. "
  },
  {
    "department": "MEJO",
    "number": 442,
    "modifier": "",
    "gen eds": "SS, US. ",
    "requirements": "",
    "description": "Gender, Class, Race, and Mass Media. 3 Credits.  The media play a critical role in the construction and contestation of ideas about gender, class, and race. Using a range of methods, students will analyze media messages past and present to understand how gender, race, and class influence media production and consumption. "
  },
  {
    "department": "MEJO",
    "number": 443,
    "modifier": "",
    "gen eds": "US. ",
    "requirements": "",
    "description": "Latino Media Studies. 3 Credits.  An introductory course to the study of United States Latina/os and the media. It analyzes the media portrayal of Latina/os in United States mainstream media. The course also examines media that cater to Latina/os and explores the way in which Latina/o audiences use the multiple media offerings available to them. "
  },
  {
    "department": "MEJO",
    "number": 445,
    "modifier": "",
    "gen eds": "SS. ",
    "requirements": "",
    "description": "Process and Effects of Mass Communication. 3 Credits.  Mass communication as a social process, incorporating literature from journalism, social psychology, sociology, political science, and history. To acquaint students with factors in message construction, dissemination, and reception by audiences. "
  },
  {
    "department": "MEJO",
    "number": 446,
    "modifier": "",
    "gen eds": "GL. ",
    "requirements": "",
    "description": "Global Communication and Comparative Journalism. 3 Credits.  Covers theories explaining the workings of global and local communication systems, the transnational flow of news, and opportunities and challenges that social media and other new platforms pose to the production and distribution of news. It also familiarizes students with the media communication systems of key countries. "
  },
  {
    "department": "MEJO",
    "number": 447,
    "modifier": "",
    "gen eds": "EE-Field Work, GL. ",
    "requirements": "Prerequisite, MEJO 137 or 153. ",
    "description": "International Media Studies. 3 Credits.  The study of media system operations in a particular country including how news and information are disseminated and used by audiences. Includes a trip to the country as part of the course. "
  },
  {
    "department": "MEJO",
    "number": 448,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Freedom of Expression in the United States. 3 Credits.  An examination of the development of freedom of expression in the United States within the context of the nation's history. "
  },
  {
    "department": "MEJO",
    "number": 449,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Blogging, Smart Mobs, and We the Media. 3 Credits.  For advanced undergraduates through Ph.D. students. Practical and theoretical approaches to understanding, designing, building, and using virtual communities, including studies of network capital, social capital, and social production. "
  },
  {
    "department": "MEJO",
    "number": 454,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisites, MEJO 153 and 256. ",
    "description": "Advanced Feature Writing. 3 Credits.  Writing and reporting important topics in in-depth feature articles. Discussion and utilization of writing and reporting techniques in order to complete articles for publication or other dissemination. In-depth instruction and critiques of student work. "
  },
  {
    "department": "MEJO",
    "number": 455,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Creative Sportswriting. 3 Credits.  Researching and writing sports stories, including game coverage, magazine features, and opinion columns. Students complete reporting and writing exercises inside and outside of the classroom. "
  },
  {
    "department": "MEJO",
    "number": 458,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Southern Politics: Critical Thinking and Writing. 3 Credits.  Interpretive-contextual journalism focused on the trends, issues, and politics that influence democracy in North Carolina, the American South, and the nation. Through readings and the practice of analytical journalism, the course explores government policy making, election campaigns, social and economic trends, ethics, and citizen-leader relationships. "
  },
  {
    "department": "MEJO",
    "number": 459,
    "modifier": "",
    "gen eds": "EE-Service Learning, US. ",
    "requirements": "Prerequisite, MEJO 153. ",
    "description": "Community Journalism. 3 Credits.  Comprehensive study of the community press, including policies, procedures, and issues surrounding the production of smaller newspapers within the context of the community in its social and civic setting. "
  },
  {
    "department": "MEJO",
    "number": 463,
    "modifier": "",
    "gen eds": "EE-Field Work. ",
    "requirements": "",
    "description": "News Lab: Creating Tomorrow's News Products. 3 Credits.  Students work under faculty guidance to develop and test an idea for a start-up news product. Students will create a prototype, test it on a target market, and compile a business feasibility report for the product. The course emphasizes collaboration among students with a variety of skills and experiences. "
  },
  {
    "department": "MEJO",
    "number": 469,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Health Communication. 3 Credits.  This course covers theory and research underlying effective health communication campaigns. Students will learn about both the development and evaluation of real-world health campaigns. "
  },
  {
    "department": "MEJO",
    "number": 471,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisites, MEJO 271 and permission of the instructor. ",
    "description": "Advanced Advertising Copywriting. 3 Credits.  Rigorous, in-depth instruction and critiques of student advertising writing. "
  },
  {
    "department": "MEJO",
    "number": 475,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Concepts of Marketing. 3 Credits.  Designed to provide the larger business context for students anticipating careers in advertising, public relations, and other media industries, the course teaches the vocabulary and basic concepts of marketing as it will be practiced. "
  },
  {
    "department": "MEJO",
    "number": 476,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Ethical Issues and Sports Communication. 3 Credits.  Permission of the instructor. Ethical dilemmas and decisions in the commercialization and coverage of sports, including the influence of television, pressure to change traditions and standards for monetary reasons, and negative influences on athletes. "
  },
  {
    "department": "MEJO",
    "number": 477,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "New Media Technologies: Their Impact on the Future of Advertising, Marketing, and Public Relations. 3 Credits.  This course will introduce you to the nontraditional, future vision required to be successful in advertising, marketing, and public relations and the more personal, individualized technologies that will grab people's attention in the future. "
  },
  {
    "department": "MEJO",
    "number": 478,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, MEJO 137. ",
    "description": "Media Marketing. 3 Credits.  Principles and practices of retail advertising in all media, with emphasis on selling, writing, and layout of retail advertising for the print media. "
  },
  {
    "department": "MEJO",
    "number": 479,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Market Intelligence. 3 Credits.  Permission of the instructor. This course helps students learn to make better business decisions by teaching contemporary analytical tools to solve brand and advertising problems. "
  },
  {
    "department": "MEJO",
    "number": 482,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, MEJO 182; pre- or co-requisite, MEJO 153. ",
    "description": "Media Design. 3 Credits.  Permission of the instructor. Detailed study of page layout and graphics techniques for all forms of news media. "
  },
  {
    "department": "MEJO",
    "number": 484,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, MEJO 182; permission of the instructor for students lacking the prerequisite. ",
    "description": "Information Graphics. 3 Credits.  Study and application of graphic design and information-gathering techniques to creating charts, maps, and diagrams. "
  },
  {
    "department": "MEJO",
    "number": 485,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, MEJO 182; pre- or co-requisite, MEJO 153; permission of the instructor. ",
    "description": "Publication Design. 3 Credits.  Detailed study and application of graphic design techniques in magazines, newspapers, advertising, and corporate communication. "
  },
  {
    "department": "MEJO",
    "number": 487,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, MEJO 187. ",
    "description": "Intermediate Interactive Media. 3 Credits.  Web programming, graphic design, and storytelling for the Web. Students will use HTML5 CSS3, JavaScript, and other Web publishing languages while learning how to design, storyboard, and script an interactive storytelling project. Students will collect and incorporate photos, text, video, graphics, and database information into interactive multimedia presentations. Previously offered as MEJO 586. "
  },
  {
    "department": "MEJO",
    "number": 488,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Multimedia Storytelling: Carolina Photojournalism Workshop. 3 Credits.  The Carolina Photojournalism Workshop has a dual mission: to provide an immersive, real-world learning experience for students, and to create and publish exceptional multimedia content on the culture of North Carolina that can be a resource for people in our state and the world. Previously offered as MEJO 587. "
  },
  {
    "department": "MEJO",
    "number": 489,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, MEJO 180. ",
    "description": "Photojournalism, Lighting, and Business Techniques. 3 Credits.  Students expand their personal photographic vision and professional portfolio by honing their knowledge and skills of studio and location lighting, propping, and styling. Students learn studio and location portraiture and photo illustration and create a photo essay or portrait series. Previously offered as MEJO 181. "
  },
  {
    "department": "MEJO",
    "number": 490,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Special Topics in Mass Communication. 1-3 Credits.  Small classes on various aspects of journalism-mass communication with subjects and instructors varying each semester. Descriptions for each section available on the school's Web site under Course Details. Honors version available Repeat rules: May be repeated for credit; may be repeated in the same term for different topics; 9 total credits. 3 total completions. "
  },
  {
    "department": "MEJO",
    "number": 522,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, MEJO 421. ",
    "description": "Producing Television News. 3 Credits.  Permission of the instructor. Students work under faculty guidance to produce \"Carolina Week,\" a television news program, and are responsible for all production tasks such as producing, reporting, anchoring, directing, and others. Previously offered as MEJO 422. "
  },
  {
    "department": "MEJO",
    "number": 523,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, MEJO 129 or 426 or 522. ",
    "description": "Broadcast News and Production Management. 3 Credits.  Permission of the instructor. Students participate in a collaborative learning environment to hone skills learned in earlier courses and help less-experienced students acclimate to the broadcast news experience within the school. By invitation only. Previously offered as MEJO 423. "
  },
  {
    "department": "MEJO",
    "number": 531,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, MEJO 137. ",
    "description": "Case Studies in Public Relations. 3 Credits.  Helps students think as public relations professionals who deal with the demanding, dynamic environment of corporate, government, and nonprofit public relations. Students examine real-world situations and strategies, discussing factors that affect how public relations is practiced in organizations, including identifying stakeholder groups, developing strategies, embracing diversity, and recognizing ethical issues. Previously offered as MEJO 431. "
  },
  {
    "department": "MEJO",
    "number": 533,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisites, MEJO 137 and 153. ",
    "description": "Crisis Communication. 3 Credits.  Provides an assessment and understanding of crises, examining the role public relations professionals play in helping organizations use mass communication theories and best practices. Includes media training. Introduces students to areas of crisis research, allowing them to complete the Federal Emergency Management Agency's National Incident Management System certification. Previously offered as MEJO 433. "
  },
  {
    "department": "MEJO",
    "number": 541,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, MEJO 153. ",
    "description": "Economics Reporting. 3 Credits.  Permission of the instructor. Coverage of Wall Street and the economy, including stocks, bonds, and economic indicators. Reporting on the Federal Reserve, labor, consumer sector, manufacturing and inflation, and certain industries. Previously offered as MEJO 451. "
  },
  {
    "department": "MEJO",
    "number": 542,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, MEJO 153. ",
    "description": "Business Reporting. 3 Credits.  Methods and tactics of covering businesses for mass communication. Why and how companies operate and how to write stories about corporate news from public records and other sources. Previously offered as MEJO 452. "
  },
  {
    "department": "MEJO",
    "number": 550,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Business and the Media. 3 Credits.  Role of media in United States society and effects on public perceptions of business. Relationship of business press and corporate America. Current issues in business journalism. Previously offered as MEJO 450. "
  },
  {
    "department": "MEJO",
    "number": 551,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Digital Media Economics and Behavior. 3 Credits.  The course will focus on the changing economics affecting 21st-century news organizations and the economic drivers of other content providers such as music companies, the film industry, online aggregators, and commerce sites for lessons that can be applied across industry segments. "
  },
  {
    "department": "MEJO",
    "number": 552,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, MEJO 452, 475 or 551. ",
    "description": "Leadership in a Time of Change. 3 Credits.  During a time of fast-paced technological innovation, this course examines the critical strategic choices facing media executives. Students will observe and research a media company that is making the transition, as well as produce a case study on that effort. "
  },
  {
    "department": "MEJO",
    "number": 553,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisites, MEJO 153 and 253. ",
    "description": "Advanced Reporting. 3 Credits.  Rigorous, in-depth instruction and critiques of students' news and feature assignments done with different reporting methodologies: interviewing, official records, direct and participant observation, and survey research (the Carolina Poll). Previously offered as MEJO 453. "
  },
  {
    "department": "MEJO",
    "number": 557,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, MEJO 157. ",
    "description": "Advanced Editing. 3 Credits.  Concentration on the editing and display of complex news and features stories and other print media content with a significant emphasis on newspaper design and graphics. Previously offered as MEJO 457. "
  },
  {
    "department": "MEJO",
    "number": 560,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Environmental and Science Journalism. 3 Credits.  Prepare students to work as environmental and science journalists. The course emphasizes writing skills in all delivery formats and interpreting environmental, science, and medical information for consumers. "
  },
  {
    "department": "MEJO",
    "number": 561,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Environmental and Science Video Storytelling. 3 Credits.  Students work in teams to produce, shoot, script, and report environmental, science, and medical stories for broadcast on \"Carolina Week\", the award-winning, student-produced television newscast. "
  },
  {
    "department": "MEJO",
    "number": 562,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Environmental and Science Documentary Television. 3 Credits.  Students work in teams to conceive, produce, and script mini-documenties on environmental and science topics for broadcast on North Carolina Public Television. "
  },
  {
    "department": "MEJO",
    "number": 564,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, MEJO 153. ",
    "description": "Medical and Science Reporting. 3 Credits.  Required preparation, a second reporting or writing course. Focuses on developing strategies to research and write about medical issues, specifically selecting topics, finding and evaluating sources, and information gathering. Students produce a range of stories, from short consumer pieces to in-depth articles. "
  },
  {
    "department": "MEJO",
    "number": 565,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Environmental Storytelling. 3 Credits.  An interdisciplinary course for students interested in environmental issues or journalism to produce stories about environmental issues that matter to North Carolinians. Students learn to identify credible sources, manage substantial amounts of information, and find story focus as they report on technical and often controversial subjects in a variety of media. "
  },
  {
    "department": "MEJO",
    "number": 570,
    "modifier": "",
    "gen eds": "QI. ",
    "requirements": "",
    "description": "Data Driven Journalism. 3 Credits.  An introduction to basic statistics and numerical and mathematical literacy, as well as a look at professional data-driven journalism projects. Students who successfully complete this course will be able to acquire, organize, analyze, and present data to a general news audience. Previously offered as MEJO 460. "
  },
  {
    "department": "MEJO",
    "number": 572,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Art Direction in Advertising. 3 Credits.  This course provide students with finished advertising for their portfolios through visual theory instruction, creative exercises, and strategy application. Previously offered as MEJO 472. "
  },
  {
    "department": "MEJO",
    "number": 577,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, MEJO 477. ",
    "description": "The Branding of Me. 3 Credits.  What have you done to brand yourself? Students will use YouTube, Twitter, and Facebook in a calculated plan with other new-media marketing tools to land that first job. Previously offered as MEJO 474. "
  },
  {
    "department": "MEJO",
    "number": 580,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, MEJO 180; pre- or co-requisite, MEJO 153; Permission of the instructor. ",
    "description": "Photo Stories. 3 Credits.  Advanced course in photojournalism content gathering, history, ethics and storytelling. Students shoot advanced newspaper and magazine assignments and create short multimedia stories combining photography, audio, and video. Previously offered as MEJO 480. "
  },
  {
    "department": "MEJO",
    "number": 581,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, MEJO 187; permission of the instructor for students lacking the prerequisite. ",
    "description": "Multimedia Design. 3 Credits.  Theory and practice of multimedia design with an emphasis on usability, design theory, and evaluative methodologies, including focus groups, survey research, eye-track testing, and search engine optimization. "
  },
  {
    "department": "MEJO",
    "number": 582,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisites, MEJO 121, and 180 or 187. ",
    "description": "Advanced Documentary Video Storytelling. 3 Credits.  Permission of the instructor. Students learn how to gather audio and video content, editing and storytelling techniques, and how to publish these media onto a variety of multimedia platforms. "
  },
  {
    "department": "MEJO",
    "number": 583,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, MEJO 187. ",
    "description": "Advanced Interactive Media. 3 Credits.  Permission of the instructor. Advanced course in multimedia programming languages that includes designing and building dynamic projects. "
  },
  {
    "department": "MEJO",
    "number": 584,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "International Projects. 3 Credits.  Permission of the instructor. Students work on a semester-long documentary multimedia project in an international location that includes photo and video journalists, audio recordists, designers, infographics artists, and programmers. Open by application to students who have completed an advanced course in visual or electronic communication. "
  },
  {
    "department": "MEJO",
    "number": 585,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisites, MEJO 187 and 182. ",
    "description": "3D Design Studio. 3 Credits.  Permission of the instructor. The use of 3D design and animation to create visual explanations. "
  },
  {
    "department": "MEJO",
    "number": 588,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Emerging Technologies. 3 Credits.  This class will teach students how to think about mobile media products. Students will learn to solve problems, design mobile user experiences, write the hybrid code to make it work, and then deploy, test, and make it better. The class will be a mix of design and product development theories. Previously offered as MEJO 660. "
  },
  {
    "department": "MEJO",
    "number": 589,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Motion Graphics. 3 Credits.  Permission of the instructor. Detailed study and application of motion-graphic techniques that utilize the combination of words, photos, graphics, video, sound, and voice-overs to convey stories for news and entertainment. Students learn Adobe After Effects software and the art of storytelling to enable them to conceptualize and execute digital animations. Previously offered as MEJO 486. "
  },
  {
    "department": "MEJO",
    "number": 596,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Individual Study. 3 Credits.  Permission of the instructor. An individual readings and problems course to be directed by a faculty member in whose field of interest the subject matter lies. Repeat rules: May be repeated for credit; may be repeated in the same term for different topics; 6 total credits. 2 total completions. "
  },
  {
    "department": "MEJO",
    "number": 602,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Mass Communication Education in the Secondary School. 3 Credits.  Graduate standing. Readings, discussion, and projects fostering excellence in teaching journalism-mass communication in the high school, from philosophy and practice to professional skills. "
  },
  {
    "department": "MEJO",
    "number": 603,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Mass Communication Law in the Secondary School. 3 Credits.  Graduate standing. Application of First Amendment speech and press freedoms to secondary school media, including libel, privacy, access to information, journalistic privilege, prior restraint, advertising and broadcast regulations, and ethical practices. "
  },
  {
    "department": "MEJO",
    "number": 604,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Mass Communication Writing and Editing in the Secondary School. 3 Credits.  Graduate standing. High school journalism teachers and advisors learn to teach the skills journalists need to communicate. Emphasis on writing and thinking skills necessary to convert information into clear messages. "
  },
  {
    "department": "MEJO",
    "number": 605,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Design and Production of Secondary School Publications. 3 Credits.  Graduate standing. High school journalism teachers and advisors learn to teach the skills journalists need to produce publications. Designed for persons with no background in design. Degree-seeking students may not use both MEJO 182 and 605 to complete degree requirements. "
  },
  {
    "department": "MEJO",
    "number": 625,
    "modifier": "",
    "gen eds": "EE-Field Work. ",
    "requirements": "",
    "description": "Media Hub. 3 Credits.  Permission of the department. Students will work together to find, produce, and market stories that would attract the attention of professional media partners throughout the state and region, and at times, the nation. This hands-on course mimics the professional journalist's work environment more than any other class in the school. "
  },
  {
    "department": "MEJO",
    "number": 634,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisites, MEJO 332, 379, and 531. ",
    "description": "Public Relations Campaigns. 3 Credits.  In this capstone experience, students apply concepts and skills from earlier classes to develop a campaign plan for a client organization. Activities include conducting background and audience research; developing realistic objectives, strategies, tactics, and evaluation plans; producing a portfolio of supporting materials; and pitching the campaign to the client. Previously offered as MEJO 434. "
  },
  {
    "department": "MEJO",
    "number": 650,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Workroom FashionMash Experiential Design. 3 Credits.  The course combines a development workshop with a professional industry project, giving students unprecedented access to working creatives, industry trendsetters, and decision makers. In Workroom students will think, write, and execute their creative ideas. "
  },
  {
    "department": "MEJO",
    "number": 651,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Workroom FashionMash Product Design. 3 Credits.  The course combines a development workshop with a professional industry project, giving you unprecedented access to working creatives, industry trendsetters and decision makers. In Workroom you will not simply think and write about your creative ideas, instead, this class is completely focused on execution. "
  },
  {
    "department": "MEJO",
    "number": 656,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisites, MEJO 153 and 356. ",
    "description": "Magazine Writing and Editing. 3 Credits.  Instruction and practice in planning, writing, and editing copy for magazines. Previously offered as MEJO 456. "
  },
  {
    "department": "MEJO",
    "number": 670,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisites, MEJO 379 and 475. ",
    "description": "Digital Advertising and Marketing. 3 Credits.  This course provides the practical knowledge and insights required to establish digital advertising and marketing objectives and strategies, properly select the earned and paid media platforms, and monitor and measure the results of those efforts. Previously offered as MEJO 470. "
  },
  {
    "department": "MEJO",
    "number": 671,
    "modifier": "",
    "gen eds": "EE-Service Learning. ",
    "requirements": "",
    "description": "Social Marketing Campaigns. 3 Credits.  Social marketing is the application of marketing concepts and practices to bring about behavior change for a social good. This course is designed as a service-learning course and fulfills the experiential education requirement. "
  },
  {
    "department": "MEJO",
    "number": 673,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, MEJO 371 or 372. ",
    "description": "Advertising Campaigns. 3 Credits.  Planning and executing advertising campaigns; types and methods of advertising research; the economic function of advertising in society. Previously offered as MEJO 473. "
  },
  {
    "department": "MEJO",
    "number": 681,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, MEJO 580. ",
    "description": "Photojournalism Projects. 3 Credits.  Permission of the instructor. Students study the documentary tradition and produce stories within the social documentary genre of photojournalism. Students choose a relevant social issue and create a multimedia Web site featuring long-form documentary storytelling. Previously offered as MEJO 481. "
  },
  {
    "department": "MEJO",
    "number": 683,
    "modifier": "",
    "gen eds": "",
    "requirements": "Prerequisite, MEJO 482. ",
    "description": "Magazine Design. 3 Credits.  Permission of the instructor. Detailed study of page layout and graphics techniques in magazines. Previously offered as MEJO 483. "
  },
  {
    "department": "MEJO",
    "number": 690,
    "modifier": "",
    "gen eds": "",
    "requirements": "",
    "description": "Special Topics in Advertising. 1-3 Credits.  Courses on special topics in advertising with subjects and instructors varying each semester. Repeat rules: May be repeated for credit; may be repeated in the same term for different topics; 9 total credits. 3 total completions. "
  },
  {
    "department": "MEJO",
    "number": 691,
    "modifier": "H",
    "gen eds": "EE-Mentored Research. ",
    "requirements": "",
    "description": " Introductory Honors Course. 3 Credits.  Permission of the instructor. Required of all students reading for honors in journalism. "
  },
  {
    "department": "MEJO",
    "number": 692,
    "modifier": "H",
    "gen eds": "EE-Mentored Research. ",
    "requirements": "",
    "description": " Honors Essay. 3 Credits.  Permission of the instructor. Required of all students reading for honors in journalism. "
  }
]